[
  {
    "text": "6 О рассылках Maxbot Основные понятия Консоль маркетолога (Marketer) — это интерфейс пользователя Maxbot, отвечающего за проведение рассылок для клиентов компании. Консоль маркетолога включает набор инструментов для автоматизации маркетинговых задач. Такими задачами могут являться, например, создание автоворонок продаж и информирование клиентов об акциях и предложениях. При помощи консоли маркетолога можно создать рассылки, позволяющие информировать клиентов компании с помощью мессенджеров или SMS-сообщений. Место консоли маркетолога в функциональной структуре Maxbot показано на рисунке 1.",
    "meta": {
      "page": 6,
      "section": null
    }
  },
  {
    "text": "8 Каждая рассылка в Maxbot имеет определенный сценарий ее выполнения, аудиторию и условия запуска. Сценарий рассылки — это набор действий, выполняемых для каждого клиента. Например, отправка ему сообщений и изображений через заданный промежуток времени. В консоли маркетолога сценарии рассылок создаются при помощи визуального конструктора (см. Рисунок 2). Рисунок 2 — Пример разработки сценария рассылки в конструкторе Аудитория рассылки — это множество клиентов, для которых бот запускает сценарий рассылки. В некоторых случаях клиенты могут не получить рассылку. Например, если они отписались от рассылок или от бота в своем мессенджере. Условия начала рассылки — это условия, при которых сценарий рассылки запускается для каждого из клиентов в аудитории рассылки. Например, наступление определенного времени, установка тега для клиента или возникновение внешнего события (клиент посетил сайт, оплатил заказ и т. д.). Типы рассылок В Maxbot можно создавать рассылки двух типов: • Информационные; • Целевые. Информационные рассылки Информационные рассылки предназначены для немедленного информирования клиентов о событиях или срочного предоставления важной информации. Они не подразумевают реакцию клиента в мессенджере. Примеры информационных рассылок: • сообщение о готовности заказа; • отправка клиенту секретного кода. Информационная рассылка приходит клиенту в любом состоянии, независимо от того, общается ли он с оператором или ботом. Поэтому информационные рассылки нужно использовать только для быстрого предоставления важной информации, и не",
    "meta": {
      "page": 8,
      "section": null
    }
  },
  {
    "text": "9 использовать для предложения товаров, услуг и других сообщений, требующих ответа или реакции со стороны клиента, т. к. это будет неуместно в контексте возможной беседы клиента с оператором или ботом. Целевые рассылки Целевые рассылки предназначены для реализации более сложных сценариев: автоворонок продаж, предложения акций и т. п. Целевые рассылки выполняются только если диалог с клиентом закрыт. Если в момент выполнения рассылки оказывается, что диалог с клиентом открыт, то выполнение рассылки откладывается до закрытия диалога. Вход в консоль маркетолога Для работы с консолью маркетолога необходима отдельная учетная запись. Учетная запись маркетолога создается администратором Maxbot в консоли управления. Примечание: Вход в консоль маркетолога также можно выполнить с использованием учетной записи администратора (administrator), которая создается по умолчанию. Пароль для доступа к консоли оператора такой же, как и к консоли управления. Для входа в консоль маркетолога нужно: 1. Перейти в браузере по ссылке http://marketer.maxbot.ai/. 2. В открывшемся окне (см. Рисунок 3) ввести данные в форму авторизации: • Компания — указать название компании; • Логин — ввести логин учетной записи маркетолога; • Пароль — ввести пароль учетной записи маркетолога. Рисунок 3 — Окно авторизации консоли маркетолога",
    "meta": {
      "page": 9,
      "section": null
    }
  },
  {
    "text": "10 3. Нажать на кнопку «Войти». При первом входе будет запущен мастер настройки пользователя, где последовательно будет предложено выбрать язык консоли маркетолога (см. Рисунок 4) и имя пользователя (см. Рисунок 5). Рисунок 4 — Выбор языка консоли маркетолога Рисунок 5 — Ввод имени После выбора языка и ввода имени необходимо нажать на кнопку «Закончить» (см. Рисунок 6). Рисунок 6 — Все готово к использованию консоли маркетолога Примечание: В дальнейшем и язык консоли, и имя пользователя можно будет изменить.",
    "meta": {
      "page": 10,
      "section": null
    }
  },
  {
    "text": "11 Интерфейс для работы с рассылками Внешний вид интерфейса консоли маркетолога показан на рисунке 7. Рисунок 7 — Интерфейс консоли управления после авторизации маркетолога В левой части окна находится меню для навигации по разделам консоли маркетолога. После входа по умолчанию выбран раздел «Рассылки». Для удобства маркетолога и структурирования созданных рассылок предусмотрена система каталогов. Изначально для рассылок задан только один каталог «Все рассылки», но при помощи кнопки «+ Добавить каталог» (отображается внизу слева от списка рассылок) можно сформировать требуемую структуру (см. Рисунок 8). Рисунок 8 — Пример структуры каталогов для рассылок",
    "meta": {
      "page": 11,
      "section": null
    }
  },
  {
    "text": "12 На мобильной версии и на десктопах при небольшом размере окна браузера открыть каталоги рассылок можно, нажав на кнопку слева от формы поиска (см. Рисунок 9). Рисунок 9 — Отображение кнопки для просмотра структуры каталогов рассылок в мобильной версии В правом верхнем углу отображаются данные текущего авторизованного пользователя (маркетолога). При нажатии на можно раскрыть контекстное меню, позволяющее перейти к настройкам, загрузить документацию, перейти к разделам помощи или выйти из консоли маркетолога (см. Рисунок 10). Рисунок 10 — Контекстное меню Также рядом с именем маркетолога отображается иконка , при нажатии на которую можно выполнить переход в другие интерфейсы Maxbot — консоль оператора (Agent) или администратора (Studio), см. Рисунок 11.",
    "meta": {
      "page": 12,
      "section": null
    }
  },
  {
    "text": "13 Рисунок 11— Меню для перехода в консоль оператора или администратора Для создания рассылки используется кнопка «+Создать», которая находится в правом верхнем углу раздела «Рассылки» (см. Рисунок 12). Рисунок 12 — Переход к созданию рассылки После нажатия на кнопку «+ Создать» необходимо ввести название рассылки, выбрать тип — «информационная» или «целевая» (см. Рисунок 13). Рисунок 13 — Ввод названия и выбор типа рассылки Далее будет открыт интерфейс создания рассылки, включающий (см. Рисунок 14): • 3 вкладки, каждая из которых отвечает за соответствующий этап настройки рассылки: • «Конструктор рассылки» (открывается по умолчанию) — вкладка для настройки сценария рассылки;",
    "meta": {
      "page": 13,
      "section": null
    }
  },
  {
    "text": "14 • «Условия начала рассылки» — вкладка для определения условий запуска рассылки и действующих ограничений, см. подробнее в разделе Настройка условий начала рассылок; • «Целевая аудитория» — вкладка для подготовки данных для рассылок с фиксированной аудиторией, см. подробнее в разделе Определение аудитории. • 2 вкладки, отражающие результаты запуска рассылки: • «Статистика» — вкладка для просмотра статистики по текущей рассылке; • «Журнал» — вкладка для просмотра статусов отправки рассылки для клиентов, см. подробнее в разделе Просмотр журнала рассылок; • Тип рассылки; • Состояние рассылки; • Кнопка для обновления сценария рассылки; • Иконки для управления запуском и остановкой рассылки. Подробнее об управлении запуском рассылки (состоянием рассылки) см. в разделе Запуск, перезапуск и остановка рассылок. Рисунок 14 — Интерфейс настройки рассылки (открыт конструктор рассылки) Иконка для управления запуском и остановом рассылок также отображается и в списке рассылок (см. Рисунок 15).",
    "meta": {
      "page": 14,
      "section": null
    }
  },
  {
    "text": "15 Рисунок 15 — Расположение кнопок запуска / остановки в списке рассылок Меню, вызываемое при помощи иконки , позволяет (см. Рисунок 16): • Посмотреть статистику; • Посмотреть Журнал; • Выгрузить данные; • Сгенерировать событие; • Переместить рассылку в нужный каталог; • Клонировать (дублировать) рассылку; • Удалить рассылку. Рисунок 16 — Расположение кнопок меню в списке рассылок Колонка с названием «Тип» визуализирует тип указанной рассылки (см. Рисунок 15). Информационные рассылки обозначаются иконкой , а целевые – .",
    "meta": {
      "page": 15,
      "section": null
    }
  },
  {
    "text": "16 Рисунок 17 — Расположение кнопок запуска / остановки в списке рассылок Рядом со строкой поиска рассылки по названию справа размещена иконка фильтра . При ее нажатии можно отфильтровать рассылки в каталоге по типу рассылки (информационная и целевая) и по состоянию рассылки (не запускалась, включена в активном режиме, в пассивном и выключена) см. Рисунок 18. Рисунок 18 - Фильтры, применяемые в каталоге рассылок Настройка сценария рассылки Конструктор позволяет задать сценарий рассылки, который будет выполняться для каждого клиента из аудитории рассылки. Сценарий рассылки состоит из: • события Start; • блоков действий; • связей между блоками действий. При создании рассылки в конструкторе автоматически создается событие Start, которое является начальной точкой выполнения сценария рассылки. Также в редакторе отображается кнопка «Добавить блок», при помощи которой в рассылку добавляются блоки действий. События и блоки действий соединяются при помощи мыши, образуя связи. В простейшем случае сценарий рассылки представляет собой событие Start, связанное с одним блоком действий (см. Рисунок 19).",
    "meta": {
      "page": 16,
      "section": null
    }
  },
  {
    "text": "17 Рисунок 19 — Создан сценарий простейшей рассылки Событие Start Событие Start происходит при запуске рассылки. После возникновения события Start сразу или через заданное время выполняются связанные с ним блоки действий (см. далее). Блоки действий Блок может содержать одно или несколько действий следующих типов: 1. Отправка сообщения; 2. Отправка сообщения, содержащего конфиденциальные данные для клиента; 3. Перевод в канал; 4. Отмена отправки запланированных сообщений этой рассылки; 5. Отмена действия кнопок рассылки; 6. Вызов внешней системы; 7. Генерация события; 8. Генерация интента. Отправка сообщения Сообщения могут содержать следующие элементы: 1. Текст сообщения — текст, который будет отправлен клиенту в мессенджер. Для ввода текста используется поле стандартного блока действий (см. Рисунок 20);",
    "meta": {
      "page": 17,
      "section": null
    }
  },
  {
    "text": "18 Рисунок 20 — Ввод текстового сообщения для отправки При нажатии на id сообщения (на представленном рисунке это «916») будет открыто окно редактирования, которое удобно использовать для ввода больших текстов рассылок. 2. Медиа-контент — изображения, видео, аудио и документы, которые могут быть добавлены к сообщению. Поддерживаются наиболее распространенные форматы (см. таблицу 1). Таблица 1 — Рекомендуемые форматы файлов и их поддержка в мессенджерах Тип Форматы Возможность загрузки файлов Viber ВКонтакте Telegram Facebook* Instagram1* Изображение",
    "meta": {
      "page": 18,
      "section": null
    }
  },
  {
    "text": "Да Да Да Да Да Важно! Список рекомендованных форматов, указанный в таблице 1, не является исчерпывающим. У каждого мессенджера есть свой список, который со временем может изменяться. Кроме того, необходимо учитывать, что мессенджеры имеют свои особенности отображения медиа-контента (например, Viber в некоторых случаях не позволяет просматривать изображения в мессенджере).",
    "meta": {
      "page": 18,
      "section": "TXT"
    }
  },
  {
    "text": "отправляется только ссылка на него. Соответственно, клиент не сможет просматривать аудио, видео или документ прямо в мессенджере (для этого нужно будет воспользоваться браузером или другим приложением.",
    "meta": {
      "page": 18,
      "section": "1 Отправка возможна для всех видов контента. При этом, для всех видов контента, кроме изображений,"
    }
  },
  {
    "text": "19 В таблице приведены наиболее универсальные форматы, подходящие для отправки клиенту в большинство мессенджеров. Перед запуском рассылки для клиентов необходимо предварительно тестировать рассылки на всех мессенджерах. Дополнительно нужно учитывать, что для некоторых мессенджеров важно, чтобы истинный формат файла соответствовал его расширению (т. е. чтобы изображение image.png действительно имело содержимое, предусмотренное форматом PNG, а не, например, данные в формате JPEG). Для добавления медиа-контента необходимо в блоке действий нажать на кнопку и в раскрывшемся меню выбрать пункт «Добавить медиа» (см. Рисунок 21). Рисунок 21 — Переход к добавлению медиа-контента Затем нужно задать тип медиа-контента и ввести ссылку (URL) на него, либо загрузить с компьютера при помощи кнопки (см. Рисунок 22). Рисунок 22 — Добавление медиа-контента 3. Медиа группа — изображения и видео, которые могут быть добавлены к сообщению группой. В отличии от предыдущего пункта, медиа группа позволяет отправлять клиенту заранее не определенное количество изображений и видео. Это удобно, например, для информирования клиентов о результате проведенных работ, когда одному",
    "meta": {
      "page": 19,
      "section": "1 Отправка возможна для всех видов контента. При этом, для всех видов контента, кроме изображений,"
    }
  },
  {
    "text": "20 клиенту нужно отправить 10 фотографий, а другому 15. С помощью медиа групп это можно сделать одной рассылкой2. Второе отличие от одиночных медиа состоит в том, что с медиа группа отправляются клиенту одним сообщением3, тогда как одиночные медиа отправляются каждое в отдельном сообщении. В группах могут отправляться только изображения и видео, документы и аудио отправляться не могут. Для добавления группы необходимо в блоке действий нажать на кнопку и в раскрывшемся меню выбрать пункт «Добавить медиа группу» (см. Рисунок 23). Рисунок 23 — Добавление медиа группы В открывшемся окне можно добавлять и редактировать ссылки на файлы, которые будут отправляться вместе с указанным сообщением (Рисунок 24). Рисунок 24 — Редактор медиа групп",
    "meta": {
      "page": 20,
      "section": "1 Отправка возможна для всех видов контента. При этом, для всех видов контента, кроме изображений,"
    }
  },
  {
    "text": "21 В поле URL можно вставить как сам URL изображения, так и макрос (подробнее о макросах в разделе «Использование макросов»). Для загрузки файлов с устройства используется кнопка . Для клонирования элементов – . Для выбора типа файла необходимо нажать на иконку и в появившемся списке выбрать тип: изображение, видео или макрос. Загруженные элементы отображаются справа. В правой области элементы можно как удалять при наведении мышки и нажатии на кнопку корзины, так и перемещать – кликнув мышкой на элемент и перетянуть в нужное место см. Рисунок 25.",
    "meta": {
      "page": 21,
      "section": "3  Возможности просмотра одиночных и групп медиа («карусель», предпросмотр в виде плиток и т.д.) зависят"
    }
  },
  {
    "text": "левой области также можно перетаскивать элементы и менять их последовательность. Для этого необходимо кликнуть мышкой на элемент и перетащить его в нужное место. Рисунок 25 — Взаимодействие с элементами в правой панели Важно! Максимальное количество элементов в медиа группе равно 50. К одному текстовому сообщению может быть присоединена только одна медиа группа. Во всех полях медиа группы можно использовать макросы. Рассмотрим случай, когда рассылка с медиа группой будет отправляться клиентам по событию.  Ссылки на изображения мы хотим задавать динамически, в аргументах события, чтобы мы могли отправить одному клиенту 11 фотографий, а другому 20 из одной рассылки. Для этого необходимо: 1. Создать событие, у которого будет 30 аргументов (это будет максимальное число изображений в медиа группе в этом примере) (Рисунок 26);",
    "meta": {
      "page": 21,
      "section": "В"
    }
  },
  {
    "text": "22 Рисунок 26 — Создание события для отправки изображений в медиа группе 2. Создать рассылку и настроить ее на начало по этому событию; 3. В конструкторе рассылки в блок добавить медиа группу; 4. В медиа группу добавить то же самое количество URL, что и в аргументах события (см. Рисунок 27); Рисунок 27 — Использование макросов с изображениями 5. В поле URL ввести аргументы события в фигурных скобках, указав в каждом поле только один аргумент, тип файла оставить как изображение (см. Рисунок 27); 6. Сохранить медиа группу.",
    "meta": {
      "page": 22,
      "section": "В"
    }
  },
  {
    "text": "23 После этого необходимо сгенерировать событие и в аргументах события указать ссылки на файлы для отправки клиенту в мессенджер см. Рисунок 28. Рисунок 28 — Генерация события с аргументами Если рассылка должна отправлять не только изображения в медиа группе, но и видео, тогда в макросах нужно передавать еще и тип медиа. Для этого в аргументах события необходимо создать в два раза больше аргументов, чтобы для каждого URL передавался еще и тип, например см. Рисунок 29: Рисунок 29 — Создания аргументов события для медиа группы В настройках медиа группы для каждого URL выбираем тип \"Макрос\" и задаем URL и его тип макросами, как показано на Рисунок 30.",
    "meta": {
      "page": 23,
      "section": "В"
    }
  },
  {
    "text": "24 Рисунок 30 — Создания медиа группы с разными типами После этого необходимо сгенерировать событие и в аргументах события указать ссылки на файлы и типы для отправки клиенту в мессенджер, например, см. Рисунок 31. Рисунок 31 — Генерация события для медиа группы с типами медиа 4. Кнопки-действия — это кнопки, позволяющие выполнять следующие действия: • Вызвать другой блок действий; • Добавить клиенту теги; • Снять теги с клиента; • Отписать клиента от рассылок (всех)4. Для добавления кнопки-действия необходимо в блоке действий нажать на кнопку и в раскрывшемся меню выбрать пункт «Добавить кнопку-действие» (см. Рисунок 32).",
    "meta": {
      "page": 24,
      "section": "В"
    }
  },
  {
    "text": "25 Рисунок 32 — Переход к добавлению кнопки-действия Затем нужно задать требуемые параметры кнопки и нажать на кнопку «Сохранить» (см. Рисунок 33). Для каждой кнопки можно указать теги, которые будут назначены клиенту (сняты с клиента), подробнее об этом см. в подразделе Работа с тегами. Рисунок 33 — Добавление кнопки-действия Примечание: Длина заголовка кнопки должна быть не более 20 символов. Действия в блоке, связанном с кнопкой, всегда выполняются сразу после нажатия кнопки. (см. Рисунок 34). Блок, вызываемый кнопкой-действием, может содержать любое из действий, описанных в разделе Блоки действий.",
    "meta": {
      "page": 25,
      "section": "4 Действие эквивалентно тому, что клиент напишет боту команды «стоп рассылки» или «stop subscriptions»,"
    }
  },
  {
    "text": "26 Рисунок 34 — Второй блок выполняется сразу при нажатии на кнопку На одну кнопку клиент может нажать только один раз. Повторные нажатия не обрабатываются. Если сценарий рассылки предусматривает возврат к блоку, который клиент уже получал, то на кнопку можно будет нажать еще раз (см. Рисунок 35). В этом примере при нажатии на кнопку «Назад» клиент получит первый блок еще раз и именно в нем можно будет еще раз нажать на кнопку «Подробнее». Рисунок 35 — Пример возврата При добавлении к сообщению более двух кнопок-действий появляется опция «Разрешить только одно нажатие» (см. Рисунок 36). Если она установлена, то клиент может нажать только на одну кнопку в этом сообщении. После первого нажатия аналогичные нажатия по другим кнопкам не обрабатываются. Если опция не установлена, то на каждую кнопку в сообщении можно нажать один раз.",
    "meta": {
      "page": 26,
      "section": "4 Действие эквивалентно тому, что клиент напишет боту команды «стоп рассылки» или «stop subscriptions»,"
    }
  },
  {
    "text": "27 Рисунок 36 — В блок добавлено две кнопки-действия Важно! Описанное выше относится только к кнопкам сообщения, а не блока. В один блок может быть добавлено несколько сообщений, каждое из которых будет содержать по нескольку кнопок. В этом случае при включенной опции «Разрешить только одно нажатие» в каждом сообщении можно будет нажать по одной кнопке. В некоторых мессенджерах текст сообщений с кнопками может обрезаться. Т.е. клиент увидит не весь отправленный ботом текст, а только первые несколько символов. Предупреждение об этом всплывет справа у окна с текстом см. Рисунок 37. Например, в мобильной версии Viber будет отображаться только первые 40 символов сообщения с кнопкой, а в десктопной версии – первые 10. Рисунок 37 - Текст с кнопкой, который обрежется в некоторых мессенджерах Чтобы обойти эту проблему рекомендуем добавлять отдельное сообщение перед сообщением с кнопкой и задавать в нем основной текст, а в сообщении с кнопкой писать что-то короткое см. Рисунок 38.",
    "meta": {
      "page": 27,
      "section": "4 Действие эквивалентно тому, что клиент напишет боту команды «стоп рассылки» или «stop subscriptions»,"
    }
  },
  {
    "text": "28 Рисунок 38 - Добавлено отдельное сообщение 5. Кнопки-ссылки — кнопки, позволяющие клиенту перейти по заданной ссылке из мессенджера. Для добавления кнопки-ссылки необходимо в блоке действий нажать на кнопку и в раскрывшемся меню выбрать пункт «Добавить кнопку-действие» (см. Рисунок 39). Рисунок 39 — Переход к добавлению кнопки-ссылки Затем необходимо задать название кнопки и ссылку для нее (см. Рисунок 40). Рисунок 40 — Создание кнопки-ссылки",
    "meta": {
      "page": 28,
      "section": "4 Действие эквивалентно тому, что клиент напишет боту команды «стоп рассылки» или «stop subscriptions»,"
    }
  },
  {
    "text": "29 Ссылка клиенту не отображается. Нажатия на кнопку-ссылку не могут приводить к запуску другого блока или иным действиям, а также никак не учитываются в статистике. Примечание: Клиент может нажимать на ссылки многократно, описанные выше ограничения по нажатиям на них не действуют. Отправка сообщения, содержащего конфиденциальные данные для клиента В общем случае вся переписка клиента с ботом доступна оператору Maxbot. Если бот используется для отправки конфиденциальной информации (например, кодов подтверждения), то такую информацию необходимо скрывать от оператора. Для отправки конфиденциальной информации в теле блока с сообщением необходимо использовать тег <security>…</security> (см Рисунок 41). Вставка закрывающего тега обязательна. Рисунок 41 — Отправка конфиденциальной информации при помощи тега <security></security> Данные, заключенные в теге <security>, для оператора заменяются на ***. То, что увидят клиент и оператор при запуске такой рассылки, показано на рисунке ниже: Рисунок 42 — Отображение содержимого тега <security> для клиента и для оператора На практике использование тега <security> будет сопровождаться использованием макроса, т. е. конфиденциальная информация вряд ли будет задаваться в рассылке статически. В этом случае тег <security> нужно использовать следующим образом (см. Рисунок 43), поместив внутрь макрос, который является аргументом события:",
    "meta": {
      "page": 29,
      "section": "4 Действие эквивалентно тому, что клиент напишет боту команды «стоп рассылки» или «stop subscriptions»,"
    }
  },
  {
    "text": "30 Рисунок 43 — Использование значения макроса в качестве конфиденциальной информации Перевод в канал Действие перевода в канал выполняется сразу, если диалог у клиента закрыт или диалог свободный5 или иное на задано в настройках действия (см. далее). При наличии открытого диалога перевод выполнен не будет, чтобы не помешать текущему общению клиента с оператором. Перевод будет отложен до тех пор, пока диалог у клиента не будет закрыт или не будут выполнены условия, заданные в настройках действия. Для добавления действия перевода в канал нужно нажать на кнопку и в раскрывшемся меню выбрать пункт «Действие», после чего выбрать «Перевести в канал» (см. Рисунок 44): Рисунок 44 — Выбор действия Затем в открывшемся окне (см. Рисунок 45) необходимо задать параметры для действия перевода в канал. В окне доступны следующие настройки: • Выберите канал — канал, в который необходимо перевести клиента;",
    "meta": {
      "page": 30,
      "section": "4 Действие эквивалентно тому, что клиент напишет боту команды «стоп рассылки» или «stop subscriptions»,"
    }
  },
  {
    "text": "31 • Текст при переводе в канал — сообщение, которое будет отправлено клиенту при переводе в канал (если оставить его пустым, то сообщение не будет отправляться); • Текст при откладывании перевода в канал — сообщение, которое будет оправлено клиенту, если в момент выполнения действия у него есть открытый диалог и он не свободный (т. е. клиент обсуждает с оператором или ботом какой-то вопрос); • Текст перед отложенным переводом в канал — сообщение, которое будет отправлено клиенту при переводе в канал, если он ранее был отложен; • Переключатель условия перевода в канал: • Перевести сразу (значение по умолчанию) — клиент будет переведен в канал без каких-либо дополнительных условий (кроме наличия открытого/свободного диалога); • Перевести после получения сообщения от клиента — клиент будет переведен только после получения от него сообщения и в соответствии с настройками, указанными ниже; Рисунок 45 — Настройка действия перевода в канал",
    "meta": {
      "page": 31,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "32 • Время ожидания сообщения — время, которое бот ожидает сообщения от клиента для перевода его в канал. Можно установить время не более 2 часов (ограничение введено, чтобы маркетолог не мог надолго «блокировать» клиента: поскольку в момент ожидания не могут выполняться другие рассылки, а также клиенту не смогут отправлять сообщения операторы); • Если клиент не ответил за заданное время — действие, которое бот выполнит, не дождавшись сообщения от клиента в течение «времени ожидания сообщения»: • «Ничего не делать» — бот не будет предпринимать каких-либо действий; клиент не будет переведен в канал, рассылка при этом продолжится согласно сценарию; • «Перевести в канал безусловно» — клиент будет переведен в канал, при этом можно задать другой канал (отличный от исходно заданного); • «Отправить сообщение» — клиенту будет отправлено сообщение, заданное в поле ниже; клиент не будет переведен в канал. Если для рассылки ниже (см. Рисунок 46) задать безусловный перевод клиента в канал по факту нажатия на кнопку «Оставить отзыв», то клиент будет переведен сразу, какого- либо сообщения от него не требуется. Рисунок 46 — Пример рассылки с переводом в канал В этом случае оператор увидит нового клиента в списке диалогов, но сообщение от клиента будет отсутствовать (см. Рисунок 47). Рисунок 47 — Клиент переведен в канал без сообщения",
    "meta": {
      "page": 32,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "33 Если же в настройках перевода в канал потребовать ввод сообщения от клиента (см. Рисунок 48), то новый диалог появится только после отправки клиентом сообщения. Рисунок 48 — Ввод условия перевода клиента в канал только при наличии от него сообщения В этом случае оператор уже сразу увидит текст сообщения и не будет тратить время на выяснение причины и содержания обращения (см. Рисунок 49). Рисунок 49 — Клиент переведен в канал после отправки им сообщения Отмена отправки запланированных сообщений Это действие позволяет маркетологу остановить рассылку для клиента при возникновении некоторого события. Например, при нажатии кнопки, при отправке финального сообщения рассылки, при истечении определенного времени. Для добавления действия нужно нажать на кнопку и в раскрывшемся меню выбрать пункт «Действие», после чего выбрать «Отключить рассылку запланированных, но еще не отправленных сообщений» (см. Рисунок 50):",
    "meta": {
      "page": 33,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "34 Рисунок 50 — Выбор действия На рисунке 51 показан пример такого сценария. Если клиент нажмет на кнопку «Не интересуюсь этим», робот отправит извинительное сообщение и отключит отправку запланированных сообщений. В данном случае это правое нижнее сообщение, которое предполагалось отправить через 5 дней. Если клиент в течение 5 дней не нажмет эту кнопку, то он получит запланированное сообщение с информацией о продлении акции. Рисунок 51 — Пример использования события отмены отправки запланированных сообщений Важно! Действие отмены отправки запланированных сообщений применяется ко всей рассылке для текущего клиента, независимо от того, из какой ветви сценария оно было вызвано.",
    "meta": {
      "page": 34,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "35 Отмена работы уже отправленных в рассылку кнопок Это действие работает аналогично предыдущему, только отменяет не отправку сообщений, а работу кнопок в сообщениях. Вместе с предыдущим действием позволяет полностью деактивировать рассылку для клиентов, у которых они будут выполнены. Для добавления действия нужно нажать на кнопку и в раскрывшемся меню выбрать пункт «Действие», после чего выбрать «Отключить работу уже отправленных в рассылку кнопок» (см. Рисунок 52): Рисунок 52 — Выбор действия В следующем сценарии (см. Рисунок 53) при нажатии на кнопку «Не интересуюсь этим» произойдет не только отмена запланированного сообщения, но и перестанет работать кнопка, отправленная клиенту в первом сообщении. Рисунок 53 — Использование действия отмены работы уже отправленных в рассылку кнопок",
    "meta": {
      "page": 35,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "36 Важно! Это действие отменяет только работу кнопок-действий. Кнопки-ссылки будут всегда доступны, клиенты смогут переходить по ним произвольное число раз. Действие отмены работы кнопок применяется ко всей рассылке для текущего клиента, независимо от того, из какой ветви сценария оно было вызвано. Вызов внешней системы Действие «Вызвать внешнюю систему» предназначено для уведомления внешней системы о достижении клиентом того или иного этапа рассылки. Для добавления вызова внешней системы нужно нажать на кнопку и в раскрывшемся меню выбрать пункт «Действие», после чего выбрать «Вызвать внешнюю систему» (см. Рисунок 54). Рисунок 54 — Выбор действия Далее необходимо задать параметры запроса к внешней системе. Для примера далее заполнено обращение к CRM компании для того, чтобы отметить интерес клиента к определенной теме в случае нажатия на определенную кнопку (см. Рисунок 55). В дальнейшем в CRM это можно будет использовать для сегментации аудитории. Пример ниже отражает вариант запроса, при выполнении которого в CRM компании сохраняются данные о том, что клиент с идентификатором 12443 интересуется товарами в категории «наушники» (headphones). Кроме строковых и числовых параметров также могут использоваться макросы, см. подробнее в разделе Использование макросов.",
    "meta": {
      "page": 36,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "37 Рисунок 55 — Ввод параметров запроса к внешней системе Если в блоке есть действие вызова внешней системы, то оно всегда выполняется первым. Если вызов завершается ошибкой (сервер возвращает HTTP-статус, отличный от 200 или не отвечает в течение времени, заданного в поле «Максимальное время выполнения запроса»), то остальные действия блока не выполняются. Если к текущем блоку привязаны последующие блоки (т. е. выполняются после отправки сообщения из этого блока), то они также не будут выполнены. Примечание: В текущей версии «Максимальное время выполнения запроса» и все подобные таймауты временно равны 0.5 секунды вне зависимости от заданного значения. Генерация события Блок этого типа позволяет вызывать события и использовать их для запуска других рассылок из текущей рассылки. Если клиент по сценарию рассылки перейдет к действию «Сгенерировать событие», то это событие будет сгенерировано либо только для него; если для события задана фиксированная аудитория (см. подробнее в разделе Определение аудитории), то событие будет сгенерировано для нее (будет запущена рассылка для множества",
    "meta": {
      "page": 37,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "38 клиентов). Это позволит начать одну или несколько других рассылок. Текущая рассылка при этом не будет остановлена, ее сценарий продолжит выполняться. Рисунок 56 — Выбор действия «Сгенерировать событие Например, есть рассылка, предлагающая клиенту воспользоваться промокодом (см. Рисунок 57). Если клиент нажимает на кнопку, то во втором блоке рассылки генерируется событие «Создание промокода для клиента». Примечание: Событие, используемое в сценарии рассылки, должно быть предварительно создано. Подробнее об этом см. в разделе Использование событий. Рисунок 57 — Рассылка, в сценарии которой генерируется событие для клиента В аргументах события, генерируемого для клиента, нужно задать требуемые значения. В нашем случае нужно задать значения для 3-х аргументов (см. Рисунок 58): • промокод — строка;",
    "meta": {
      "page": 38,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "39 • размер скидки (%) — число; • действует до — строка. Рисунок 58 — Событие «Создание промокода для клиента» и его аргументы Пример ввода значений аргументов события показан на рисунке 59. При указании строковых значений необходимо использовать символ кавычек (“); числовые значения и даты задаются без кавычек. Значение аргумента также может быть пустым (не задано). При этом могут быть заданы как статические значения аргументов (в примере выше), так и динамические — макросы, уникальные для каждого клиента. Переключатель под названием события определяет, для кого будет сгенерировано событие: • только для текущего клиента или • для множества клиентов (для рассылок с фиксированной аудиторией).",
    "meta": {
      "page": 39,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "40 Рисунок 59 — Ввод аргументов для события Теперь можно создать вторую рассылку, которая будет выполняться при генерации события в первой рассылке. Ниже пример такой рассылки (см. Рисунок 60): Рисунок 60 — Вторая рассылка, запускаемая по сгенерированному событию и использующая значения аргументов события Примечание: Если рассылка запускается по событию, то его аргументы можно использовать в рассылке как макросы. На рисунке выше во второй рассылке при помощи скобок {{ }} используются значения аргументов сгенерированного события. Для данной рассылки нужно выбрать условие «Начинать при возникновении события» и событие «Создание промокода для клиента» (см. Рисунок 61), после чего запустить ее. Рассылка будет «ожидать» выбранного события и выполнится у клиентов, для которых оно наступило.",
    "meta": {
      "page": 40,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "41 Рисунок 61 — Определение условий начала второй рассылки Если в результате выполнения первой рассылки (см. Рисунок 57) клиент нажмет кнопку «Получить промокод», то в результате выполнения второй рассылки будут получены данные промокода (см. Рисунок 62). Рисунок 62 — После нажатия на кнопку «Получить промокод» для клиента выполнилась вторая рассылка Генерация интента Блок этого типа позволяет сгенерировать интент (intent) — намерения пользователя, которые могут быть распознаны системой для того, чтобы затем вызвать определенный навык бота.",
    "meta": {
      "page": 41,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "42 Для вызова навыков бота необходимо: 1. Нажать на кнопку и в раскрывшемся меню выбрать пункт «Действие», после чего выбрать «Сгенерировать intent» (см. Рисунок 63). Рисунок 63 — Выбор действия «Сгенерировать intent» 2. В настройках действия (см. Рисунок 64) задать название интента и (необязательно) словарь сущностей (entities). Важно, что в поле «Entities» должен быть задан именно словарь в формате JSON (как на рисунке ниже), иначе выполнение сценария рассылки завершится ошибкой. В словаре могут быть использованы как макросы и переменные окружения (в нотации «slots.m.macros_name»), так и статические значения. Этот словарь должен быть валидным jinja-выражением. Константные выражения также нужно задавать правильно — строки только в кавычках, числа — без, и они не должны оставаться пустыми. Рисунок 64 — Ввод параметров интента",
    "meta": {
      "page": 42,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "43 3. Нажать на кнопку «Сохранить». В результате выполнения этого действия бот сгенерирует указанный интент и передаст slots в качестве параметров. Это позволит запустить нужный навык бота для клиента (например, выбор определенного товара или услуги). Примечание: Чтобы бот выполнил определенное действие, навыки бота должны быть предварительно настроены. В перспективе это действие должно вытеснить большинство переводов в канал – вместо того, чтобы передавать клиента оператору и занимать его время, рассылка будет вызывать соответствующий навык бота. Блок-комментарий В рассылки любого типа можно вставить блок-комментарий, который будет содержать произвольный текст. Для добавления блока-комментария к рассылке необходимо в левом нижнем углу нажать на кнопку «Добавить блок», после чего выбрать значение «Комментарий» (см. Рисунок 65) и перетащить его на область сценария рассылки. Рисунок 65 — Добавления блока-комментария Блок данного типа является информационным: он не имеет каких-либо настроек (за исключением текста комментария) и не может иметь связей с другими блоками рассылки. Блок «SMS-сообщения» В рассылку также можно добавить блок «SMS-сообщения», выбрав соответствующий пункт в меню добавления блоков (см. Рисунок 66). Блок позволяет отправлять клиентам SMS-сообщения, а также направлять клиентов на посадочную страницу для подключения мессенджера и автоматического подтверждения номера телефона. Подробнее об использовании блока «SMS-сообщения» см. в разделе Настройка SMS- рассылок.",
    "meta": {
      "page": 43,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "44 Рисунок 66 — Добавления блока «SMS-сообщения» Примечание: По умолчанию после создания рассылки добавление блока «SMS-сообщения» недоступно. Для разблокирования этой возможности необходимо сначала выбрать SMS- провайдера, см. подробнее в разделах Регистрация SMS-провайдера и Добавление SMS-провайдера в рассылку. Блок «Форма» При необходимости проведения опроса клиентов можно добавить в рассылку блок «Форма» (см. Рисунок 67). Блок позволяет при помощи конструктора задать порядок проведения опроса, а также форматы вопросов и ответов. Подробнее о возможностях данного блока и особенностях его применения в рассылках см. в разделе Опрос клиентов с помощью форм. Рисунок 67 — Добавления блока «Форма» Связи между блоками действий Связь между событием и блоком означает безусловное выполнение действий блока сразу или через заданный промежуток времени после возникновения события. Таким образом, связь всегда исходит из событий и заканчивается в блоке действий. В один блок действий могут приходить несколько связей.",
    "meta": {
      "page": 44,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "45 Список событий, из которых может исходить связь: 1. Событие Start, т. е. начало выполнения сценария рассылки (см. Рисунок 68); Рисунок 68 — Связь исходит из события Start 2. Нажатие на кнопку-действие (см. Рисунок 69); Рисунок 69 — Связь исходит из кнопки «Узнать подробности» 3. Отправка сообщения клиенту. От события отправки сообщения также можно строить связь, для этого следует начать связь из точки в правом нижнем углу (см. Рисунок 70). Важно, что это событие происходит только когда сообщение непосредственно ставится в очередь на отправку, а не когда сообщение должно было отправиться. Например, в приведенном ниже рисунке второе сообщение должно отправиться через 5 дней. Если первое сообщение не отправилось сразу после начала рассылки (например, у клиента был открыт диалог и его закрыли только через 1 день), то второе отправится только через 5 дней после отправки первого, т. е. через 6 дней после начала рассылки (а не через 5, как это может показаться из сценария). Поэтому рассылки с подобными связями могут растягиваться на неопределенное время.",
    "meta": {
      "page": 45,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "46 Рисунок 70 — Связь исходит из блока с сообщением Из события Start может исходить произвольное количество связей. Из остальных событий — только по одному. У всех связей, кроме тех, что исходят из кнопок, можно задать задержку (см. Рисунок 70). Также стоит отметить, что этой точки в правом нижнем углу нет, если в блоке нет действия отправки сообщения (не от чего отталкиваться). Дублирование блоков Если необходимо быстро скопировать блок со всем его содержимым, то необходимо в верхней части нажать на и затем в раскрывшемся меню выбрать «Дублировать» (см. Рисунок 71). Рисунок 71 — Вызов функции дублирования блока Упорядочивание сообщений в блоке Если блок имеет несколько сообщений, то их можно упорядочить. Чтобы сделать это, необходимо нажать напротив нужного сообщения на , затем в открывшемся меню с помощью пунктов «Переместить наверх» и «Переместить вниз» определить местоположение сообщения (см. Рисунок 72).",
    "meta": {
      "page": 46,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "47 Рисунок 72 — Определение местоположения сообщения Удаление сообщений из блока Ненужные сообщения из блока можно удалить. Чтобы сделать это, нужно нажать напротив сообщения на , в открывшемся меню выбрать пункт «Удалить» (см. Рисунок 73), затем во всплывающем окне подтвердить удаление. Рисунок 73 — Удаление сообщения из блока",
    "meta": {
      "page": 47,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "48 Контроль изменения сценария и настроек рассылки в нескольких окнах браузера В Maxbot функционирует механизм, отслеживающий редактирование сценария и настроек рассылки в разных окнах (вкладках) браузера. Это сделано для того, чтобы правки в ранее открытой вкладке не могли «затереть» изменения, сделанные в другой. Механизм контроля работает следующим образом. Например, если открыть рассылку в двух вкладках, отредактировать ее в первой вкладке, а затем попытаться отредактировать во второй, то будет отображено следующее сообщение (см. Рисунок 74). Аналогичное сообщение будет отображено в случае, когда одна рассылка одновременно редактируется двумя или более маркетологами Рисунок 74 — Ошибка при одновременном редактировании сценария в разных вкладках браузера В этом случае необходимо обновить страницу для продолжения редактирования сценария рассылки в этом окне. Изменение, которое привело к появлению этого сообщения, не сохранится. Настройка условий начала рассылки Настройки, задаваемые на вкладке «Условия начала рассылки», определяют правила запуска для клиентов из аудитории рассылки. Эти настройки можно разделить на четыре части (см. Рисунок 75): • Условия начала рассылки для клиентов (1); • Время, после которого рассылка не начнется для клиента (2); • Время, когда никакие действия рассылки не выполняются для клиента (3); • Расширенные настройки (4).",
    "meta": {
      "page": 48,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "49 Рисунок 75 — Настройки условий начала рассылки Важно отметить, что условия начала задаются до первого запуска рассылки в состоянии «Не запущена» (см. подробнее в разделе Возможные состояния рассылки). После запуска рассылки изменить условия начала нельзя. Это касается следующих изменений: • изменение условия начала рассылки (т. е., например, перехода от тега к событию), • изменение тега или события, которые начинают рассылку, • изменение времени, в которое начнется рассылка (для рассылок с фиксированной аудиторией, которые начинаются в заданное время); • изменение времени, после которого рассылка не начнется для клиента. Если нужно изменить эти параметры, следует клонировать рассылку и внести изменения до запуска рассылки, см. подробнее в разделе Изменение условий начала и аудитории для запущенной рассылки. Условия начала Начать сразу после запуска рассылки При выборе этой настройки рассылка начинает выполняться для всех клиентов из аудитории рассылки сразу после ее запуска. Аудитория рассылки фиксирована (задается до запуска рассылки) и не может быть изменена до остановки рассылки. После того, как рассылка начнется для всех клиентов она автоматически переходит в пассивный режим. В этом состоянии продолжается выполнение сценария рассылки для клиентов.",
    "meta": {
      "page": 49,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "50 Начинать в заданное время При выборе этой настройки рассылка стартует для всех клиентов из аудитории рассылки в заданное маркетологом время. Прочие условия аналогичны предыдущей опции. Начинать в заданное время и отправлять равномерно Эта настройка позволяет автоматически разделить аудиторию и отправлять рассылки одинаковыми «порциями». Это может быть полезно, например, чтобы сделать нагрузку на операторов, принимающих заявки от клиентов из рассылки, более-менее равномерной. Как и в двух предыдущих случаях аудитория рассылки фиксирована и задается до ее запуска. Схема работы рассылки при выборе данной опции следующая: все клиенты аудитории разделяются на подгруппы заданного размера, например, по 500 человек. Рассылка начинается не для всех клиентов из аудитории сразу, как для предыдущих двух вариантов, а только для клиентов одной подгруппы. Далее бот ждет заданное время, и начинает рассылку для следующей подгруппы клиентов. При этом рассылка начинается для подгрупп клиентов только в заданное время, например, «вторник-четверг с 11 до 16». В остальное время рассылка не начинается. При выборе этой настройки отображаются дополнительные опции (см. Рисунок 76): • Даты начала и окончания — определяют время, когда рассылка начнется6 для первой «порции» клиентов и когда она перестанет начинаться. Иными словами, если для какого-то клиента из аудитории рассылки первый блок рассылки не успеет выполниться в заданный промежуток времени, то рассылка для этого клиента уже не начнется; • Две группы с одинаковыми настройками, определяющих, как рассылка должна проводиться в рабочие и в выходные дни. В каждой группе задаются следующие параметры: • «Часы работы» — часы, в которые рассылка будет пытаться начаться для очередной подгруппы клиентов; • «Отправлять каждые» — интервал, через который рассылка будет начинаться для следующей группы клиентов; • «Максимальное количество клиентов за одну отправку» — размер группы клиентов, для которых рассылка будет начинаться через каждый заданный интервал времени.",
    "meta": {
      "page": 50,
      "section": "5 Свободный диалог — диалог, у которого канал Bot."
    }
  },
  {
    "text": "51 Примечание: Одну из групп настроек можно полностью выключить, сняв флажок рядом с названием. В этом случае она применяться не будет. Например, с настройками как на рисунке далее рассылка будет начинаться каждые 10 минут для очередных 100 клиентов из множества всех клиентов аудитории рассылки. Рисунок 76 — Ввод дополнительных настроек для условия «Начинать в заданное время и отправлять равномерно» Важно! Дни и часы, заданные в настройках равномерной рассылки, могут противоречить дням и часам, заданным в группе Время, когда запланированные действия рассылки не выполняются. В этом случае приоритет имеют настройки исключения времени. Т. е. если",
    "meta": {
      "page": 51,
      "section": "6 Подробнее о режимах (состояниях) рассылки см. в разделе Возможные состояния рассылки."
    }
  },
  {
    "text": "52 один и тот же день задан в настройках равномерной рассылки и в настройках исключения, то рассылка в этот день начинаться не будет. Кроме того, нужно учитывать, что настройка времени равномерной рассылки применяется в часовом поясе компании, а настройка исключения по времени — в часовом поясе клиента. Начинать в заданное время и отправлять равномерно (аудитория из внешней системы) При выборе этого варианта, как и в предыдущем случае, рассылка начинается для клиентов равномерно, одинаковыми «порциями» через заданный период времени. Например, можно начинать рассылку для очередных 100 клиентов через каждые два часа. Отличие от предыдущего случая состоит в источнике клиентов. В данном случае список клиентов, для которых начнется рассылка, загружается динамически из внешнего REST-сервиса при каждой попытке начать рассылку, а не из файла как в предыдущем случае. Для примера рассмотрим рассылку с настройками как на рисунке ниже: Рисунок 77 – Основные настройки равномерной рассылки с аудиторией из внешней системы После запуска такой рассылки Marketer будет каждые 40 минут запрашивать па адресу «http://example.com/api/v1/customers» список из 200 клиентов в определенном формате (описан ниже). После проверки полученных данных рассылка начнется для этих клиентов. То же самое произойдет еще через 40 минут и так далее в зависимости от других настроек рассылки, которые позволяют ограничить эти запросы по времени. При этом если сервер повторно отдаст клиента, для которого эта рассылка уже началась, то рассылка не начнется для него повторно. Все клиенты, для которых рассылка успешно началась, будут отображаться на вкладке «Целевая аудитория». Настройки рассылки в этом случае полностью совпадают с настройками обычной равномерной рассылки для фиксированной аудитории, описанной в предыдущем разделе. Так же задаются часы работы в рабочие и выходные дни, общие ограничения по времени работы и лимиты на количество клиентов. Подробнее это описано в разделе «Начинать в заданное время и отправлять равномерно».",
    "meta": {
      "page": 52,
      "section": "6 Подробнее о режимах (состояниях) рассылки см. в разделе Возможные состояния рассылки."
    }
  },
  {
    "text": "53 Формат данных списка клиентов Marketer выполняет GET запрос по указанному в поле «URL для получения аудитории» адресу и добавляет к нему параметр limit, в котором указывает максимальное количество клиентов. Внешний REST-сервис должен отдавать список клиентов в формате, описанном в разделе «Формат файлов JSON» ниже. При этом количество клиентов не должно превышать значение, заданное в параметре limit (но может быть меньше). Это значение устанавливается маркетологом при настройке рассылки в полях «Максимальное количество клиентов за одну отправку» для выходных и рабочих дней отдельно. Если внешний REST-сервис вернет больше клиентов, чем задано в limit, то будет сгенерирована ошибка, рассылка не отправится ни одному клиенту. Через заданное в настройках рассылки время будет выполнен следующий запрос, будут выполняться те же проверки и т.д. Например, в рассылке с настройками как на рисунке выше указан «URL для получения аудитории» http://example.com/api/v1/customers и «Максимальное количество клиентов за одну отправку» 200. Каждые 40 минут Marketer будет выполнять запрос GET http://example.com/api/v1/customers?limit=200 и этот REST-сервис должен возвращать JSON вида { \"customers\": [ { \"id\": 123456, \"timezone\": \"Europe/Moscow\", \"failback_to_sms\": true, \"customer_data\": { \"first_name\": \"Gregory\" } } ], \"macroses\": [ { \"name\": \"first_name\", \"type\": \"string\" } ] } В данном случае в списке указан один клиент и рассылка начнется только для него.",
    "meta": {
      "page": 53,
      "section": "6 Подробнее о режимах (состояниях) рассылки см. в разделе Возможные состояния рассылки."
    }
  },
  {
    "text": "54 Если сервер требует авторизацию, то токен может быть задан в поле «Bearer авторизация», Рисунок 78 – параметры авторизации внешнего REST-сервиса В таком случае Marketer будет выполнять запрос с HTTP-заголовком Authorization: Bearer abcdefghijklmnopqrstuvwxyz Тестирование запросов Для проверки работы внешнего REST-сервиса можно воспользоваться кнопкой «Выполнить тестовый вызов». Marketer выполнит GET запрос по указанному URL с параметрами, указанными в настройках, и частично произведет валидацию полученных данных. Если данные будут получены успешно и будут удовлетворять формату, описанному выше (см. Формат данных списка клиентов), то результат будет как на рисунке ниже: Рисунок 79 – Успешное выполнение тестового запроса на загрузку аудитории рассылки",
    "meta": {
      "page": 54,
      "section": "6 Подробнее о режимах (состояниях) рассылки см. в разделе Возможные состояния рассылки."
    }
  },
  {
    "text": "55 Если Marketer не сможет получить данные по заданному URL, либо их формат не будет соответствовать требуемому, то результат будет иметь такой вид: Рисунок 80 – Выполнение тестового запроса завершилось ошибкой. Формат данных в ответе внешнего REST-сервиса не соответствует требуемому. Важно! Успешное выполнение тестового запроса не гарантирует успешное начало рассылки для клиентов при ее выполнении, т.к. некоторые проверки, например, полноты указанных макросов для каждого клиента, происходят только в ходе выполнения рассылки. Отладка рассылок с аудиторией из внешней системы Если рассылка не начинается для клиентов в указанное время или начинается, но не для всех, можно определить причину такого поведения системы. Для этого необходимо скачать журнал запросов, которые выполнял Marketer к внешнему REST-сервису. Это можно сделать в настройках рассылки на вкладке «Статистика»: Рисунок 81 – Загрузка журнала запросов аудитории рассылки При скачивании журнала можно применить фильтры по датам, чтобы исключить ненужные данные. Результат представляет собой файл в формате JSON, который описывает все запросы, которые выполнял Marketer для загрузки аудитории, и результаты обработки полученных данных. Формат файла подробно описан ниже. Если информации о запросах за нужное время нет, это значит, что настройки рассылки запрещают начинать ее в это время, или рассылка была в пассивном или отключенном состоянии.",
    "meta": {
      "page": 55,
      "section": "6 Подробнее о режимах (состояниях) рассылки см. в разделе Возможные состояния рассылки."
    }
  },
  {
    "text": "56 Формат файла с журналом запросов аудитории рассылки Поле Описание url URL, который использовался для выполнения запроса списка клиентов. response_json Ответ, полученный от сервера. Задано, только если в ответе содержался валидный JSON. response_text Ответ, полученный от сервера. Задано, только если ответ сервера не является валидным JSON. macroses Список макросов, выделенных из ответа сервера. success_customers Список клиентов, для которых рассылка должна успешно начаться. duplicate_customers Список клиентов, для которых рассылка уже начиналась и повторно не начнется. failed_customers Список клиентов, данные которых не прошли валидацию. Например, не задан один из макросов или нет необходимых, согласно заданному формату, полей. error Сообщение об ошибке при выполнении запроса. first_date Дата запроса (или дата первого запроса в серии, если count > 1) last_date Дата запроса (или дата последнего запроса в серии, если count > 1) count Количество запросов в серии одинаковых запросов. Если значение более 1, то это означает, что между first_date и last_date произошло count одинаковых ошибок. Смысл в том, чтобы не засорять журнал множеством одинаковых записей. history_id Идентификатор записи в журнале. Начинать при получении ключевого слова В этом случае рассылка начинается для тех клиентов, которые отправили боту одно из ключевых слов. Ключевое слово должно полностью совпадать с одним из заданных в настройках рассылки текстов (см. Рисунок 82). В одну рассылку можно добавить до 10 ключевых слов. Подобные рассылки могут использоваться в различных маркетинговых кампаниях. Например, маркетолог в одной из соцсетей размещает рекламный пост с предложением получить скидку на товары или услуги. Для этого клиент должен написать боту определенное слово или фразу, например, «ХочуСкидку». Если клиент отправляет такое сообщение, для него начинается рассылка – автоворонка продаж.",
    "meta": {
      "page": 56,
      "section": "6 Подробнее о режимах (состояниях) рассылки см. в разделе Возможные состояния рассылки."
    }
  },
  {
    "text": "57 Рисунок 82 — Настройка рассылки, которая начинается по ключевым словам При проверке совпадения ключевых слов есть ряд важных особенностей: • Регистр букв не учитывается. Например, если в настройках рассылки будет указано слово «ХочуСкидку», а клиент пришлет «хочускидку», то рассылка начнется; • Пробельные символы до и после слова/фразы не учитываются. Например, если в настройках рассылки будет указано слово «ХочуСкидку», а клиент пришлет «  ХочуСкидку   », то рассылка начнется; • Проверяется совпадение всего сообщения целиком. Например, если в настройках рассылки будет указано слово «ХочуСкидку», а клиент пришлет «ХочуСкидку, пожалуйста», то рассылка не начнется; • Минимальная длина ключевого слова – один символ. Например, можно использовать смайлик –   . Есть ограничение, что для каждого ключевого слова может быть запущена (в активном режиме) только одна рассылка. То есть запуск двух рассылок с одним ключевым словом невозможен. Ограничений на существование рассылок в пассивном и других режимах, настроенных на начало по одному ключевому слову, нет. Еще одним условием начала рассылки по ключевым словам, является состояние диалога, в котором клиент отправляет ключевое слово. Если клиент использует ключевое слово в переписке с оператором (состояние диалога active7) или ботом (состояние диалога bot), то рассылка не начнется. Если ключевое слово будет использовано при ожидании в канале (состояния диалога waiting), то рассылка начнется, но клиент будет уведомлен о том, что ожидание в канале прервано и он вернулся к боту. Ниже представлена Таблица 2, описывающая поведение бота при использовании ключевых слов в разных состояниях диалога.",
    "meta": {
      "page": 57,
      "section": "6 Подробнее о режимах (состояниях) рассылки см. в разделе Возможные состояния рассылки."
    }
  },
  {
    "text": "58 Таблица 2 — Состояние диалога во время начала рассылки по ключевым словам Состояние диалога closed bot waiting active Может ли начаться рассылка по ключевым словам? * * - При использовании ключевого слова обращение к оператору будет отклонено. Клиент будет уведомлен об этом и перемещен в канал bot. После этого начнется рассылка по ключевым словам. Чтобы рассылка больше не начиналась для клиентов, нужно либо задать дату с временем окончания рассылки, либо вручную остановить рассылку или перевести ее в пассивный режим. Начинать при выставлении тега В этом случае рассылка стартует для тех клиентов, которые после ее запуска получили один из заданных тегов. Если тег уже был выставлен ранее, то рассылка не стартует. Если после запуска рассылки тег был выставлен дважды, т. е. сначала выставлен, потом удален, а затем снова выставлен, то рассылка может прийти клиенту дважды. Может — потому что есть другая опция, регулирующая это поведение, об этом далее в подразделе Расширенные настройки. Чтобы прекратить запуск рассылок для клиентов, которые получают заданные теги, нужно остановить рассылку или перевести ее в пассивный режим, либо задать дату с временем окончания рассылки. Начинать при возникновении события В этом случае сценарий рассылки будет запущен для тех клиентов, для которых после запуска рассылки сгенерировано внешнее событие. Например, CRM компании может сгенерировать событие «Клиент совершил покупку». Информация об этом событии вместе с дополнительными аргументами может быть передана в консоль маркетолога, и для клиента может быть запущена специальная рассылка. Подробнее об этом описано в разделе Использование событий. Чтобы прекратить запуск рассылок для клиентов, для которых генерируются события, нужно остановить рассылку или перевести ее в пассивный режим, либо задать дату с временем окончания рассылки.. Начинать при возникновении события для заданной аудитории В этом случае рассылка стартует при возникновении события, но не для заданного в событии клиента, а для указанной в настройках рассылки целевой аудитории.",
    "meta": {
      "page": 58,
      "section": "7 Подробнее состояния диалогов описаны в Руководстве оператора в разделе «Приложение Б. Статусы"
    }
  },
  {
    "text": "59 Время, после которого рассылка не начнется для клиентов Эта настройка ограничивает начало рассылки для клиентов, если указанное в настройке время истекло. Настройка необходима тогда, когда у рассылки есть ограничение в актуальности отправляемых данных. Например, маркетолог создает рассылку с акцией, которая действует до конца недели и запускает рассылку в начале недели. У клиента в момент запуска рассылки может быть открыт диалог с оператором и диалог может не закрываться до конца недели.  Если описанная настройка не будет использоваться, то клиент получит рассылку, когда акция уже закончится (т.к. рассылка будет отложена до завершения диалога с оператором). А если маркетолог задаст ограничение по времени, то такого не произойдет, клиент не получит неактуальную рассылку. Рисунок 83 - Настройка ограничения времени запуска рассылки Настройку можно применить при любом условии начала рассылки и новые запуски рассылки прекратятся, даже если будет сгенерировано событие, или выставлен тег, или наступят другие условия начала рассылки.  Это позволяет не допустить случайной отправки рассылки по событию или тегу после того, как рассылка потеряет актуальность. Важно! Если рассылка успеет начаться до установленного в настройке времени, т.е. для клиента выполнится хотя бы один блок рассылки, то она будет продолжаться и после этого времени. Кнопки будут работать, запланированные сообщения будут отправляться. По умолчанию опция отключена, но для равномерных рассылок она присутствует всегда и называется по-другому: «Рассылка закончится для клиентов в» (см. Рисунок 84). Рисунок 84 – Настройка времени окончания запусков для равномерных рассылок",
    "meta": {
      "page": 59,
      "section": "7 Подробнее состояния диалогов описаны в Руководстве оператора в разделе «Приложение Б. Статусы"
    }
  },
  {
    "text": "60 Время, когда запланированные действия рассылки не выполняются для клиента В этой части настроек задаются дни недели и время, в которые клиенту не будут отправляться сообщения и выполняться запланированные действия рассылки. Если какой-то шаг рассылки попадет на запрещенное время, то он будет отложен. Например, если по сценарию рассылки клиент должен получить сообщение в 1 час ночи, то отправка сообщения будет отложена до 9 утра (при настройках запрещенного времени по умолчанию, см. Рисунок 85). Время, заданное в этой части настроек, рассчитывается в часовом поясе клиента. Т. е. рассылка типа «Начать сразу после запуска рассылки», запущенная в 15:00 по московскому времени, не придет клиенту из Владивостока сразу, а будет отложена до 9:00 в его часовом поясе (при настройках запрещенного времени по умолчанию). Рисунок 85 — Настройка запрещенного времени и дней недели для рассылок Для информационных рассылок целесообразно не задавать запрещенное время, т. к. некоторые из них, например, получение секретных кодов, должны работать в режиме 24/7. Расширенные настройки Для рассылок, начинающихся по событию или тегу, группа расширенных настроек имеет следующий вид (см. Рисунок 86):",
    "meta": {
      "page": 60,
      "section": "7 Подробнее состояния диалогов описаны в Руководстве оператора в разделе «Приложение Б. Статусы"
    }
  },
  {
    "text": "61 Рисунок 86 — Расширенные настройки для рассылок, начинающихся по событию или по тегу Для рассылок с фиксированной аудиторией группа расширенных настроек имеет следующий вид (см. Рисунок 87): Рисунок 87 — Расширенные настройки для рассылок с фиксированной аудиторией Примечание: Подробнее о типах аудитории см. в разделе Определение аудитории. Отличаются эти случаи наличием следующих настроек: • «Отправлять клиентам, которые уже получали эту рассылку». Если флажок снят, то рассылка для каждого клиента начнется только однажды. Если флажок установлен, то для каждого клиента может быть запущено неограниченное количество одной и той же рассылки. Для динамической аудитории данная опция позволяет автоматически предотвратить отправку рассылки одному клиенту более одного раза.",
    "meta": {
      "page": 61,
      "section": "7 Подробнее состояния диалогов описаны в Руководстве оператора в разделе «Приложение Б. Статусы"
    }
  },
  {
    "text": "62 Для рассылок с фиксированной аудиторией эта настройка не имеет смысла, т. к. такая рассылка может запуститься только один раз на каждого клиента. • «Исключить клиентов, добавленных в рассылки». При запуске одинаковых рассылок на несколько разных аудиторий возможна следующая проблема: из-за неточного разделения на аудитории некоторые из клиентов могут получить одинаковые рассылки несколько раз. Проверка аудитории рассылки вручную может быть довольно сложной и долгой, и при этом все равно не исключает повторных ошибок. Данная настройка позволяет решить проблему повторной отправки одинаковых рассылок одному и тому же клиенту. В поле можно указать несколько рассылок, аудитория каждой из них будет исключаться из аудитории текущей рассылки (см. Рисунок 88). Рисунок 88 — Исключение клиентов, добавленных в другие рассылки Если аудитория текущей рассылки будет загружена позже, то исключение клиентов произойдет при загрузке. Если аудитория текущей рассылки уже загружена, то исключение происходит при добавлении каждой новой рассылки в список исключений. Если рассылка еще не запущена, то клиенты просто удаляются из аудитории текущей рассылки. Если рассылка запущена, то они не удаляются, но помечаются как исключенные, и рассылка для них не начнется. Но если рассылка для них уже началась, то она продолжит выполняться. Т. е. эту настройку можно менять у рассылки в любом состоянии, но исключения сработают только для клиентов, для которых рассылка еще не успела начаться (такое вполне вероятно для равномерной рассылки, см. подраздел Начинать в заданное время и отправлять равномерно). Настройка применима только к рассылкам с фиксированной аудиторией и добавлять в исключения можно только рассылки с фиксированной аудиторией. В группу расширенных настроек также входят следующие опции: • «Останавливать рассылку для клиентов, получивших один из тегов | у которых удален один из тегов» — при выставлении или снятии с клиента заданного тега его рассылка может быть принудительно остановлена. Это может быть полезно, например, если клиенту запущена рассылка, целью которой является предложение какой-то услуги. Когда клиент приобретает услугу, ему можно выставить соответствующий тег, и рассылка остановится.",
    "meta": {
      "page": 62,
      "section": "7 Подробнее состояния диалогов описаны в Руководстве оператора в разделе «Приложение Б. Статусы"
    }
  },
  {
    "text": "63 При остановке рассылки по тегу отправка запланированных сообщений клиенту не выполняется, кнопки перестают работать. Отменить это действие нельзя. Подробнее о тегах см. в разделе Работа с тегами. Тег может быть снят двумя способами: • При нажатии клиентом кнопки-действия, в настройках которой задано снимать тег; • Вызовом API консоли маркетолога, см. подробнее запрос «Изменение тегов клиентов» в разделе API консоли маркетолога. • «Отправлять сообщения, даже если клиент отписался от рассылок» — эта опция позволяет отправлять рассылку клиентам даже если они отписались от рассылок. Не следует злоупотреблять этой возможностью в маркетинговых целях. Она предназначена для оповещения клиентов о критически важной информации и работы информационных рассылок. • SMS-провайдер — это поле определяет провайдер, который будет использоваться для отправки SMS. Без выбора провайдера добавление SMS-блоков в рассылку будет невозможно (см. также раздел Настройка SMS-рассылок). • Тэги сообщений – это поле определяет специальный тег для отправки рассылок клиентам Facebook*. Без тега клиенту Facebook* не будут приходить рассылки, если за последние 24-часа клиент не общался с ботом или оператором. Для того, чтобы рассылки приходили клиентам всегда, необходимо выставить один из тэгов, который будет соответствовать цели рассылки: • CONFIRMED_EVENT_UPDATE - Отправка клиенту напоминаний или обновлений в связи с мероприятиями, на которые он зарегистрировался. • POST_PURCHASE_UPDATE - Уведомление клиента об обновлении, связанном с недавней покупкой. • ACCOUNT_UPDATE - Уведомление клиента об однократном изменении его заявки или аккаунта. С подробным описанием этих тегов можно ознакомиться в документации Facebook*. Можно не задавать тег, если рассылка не будет отправляться клиентам Facebook*. Выставленный тег не влияет на клиентов других мессенджеров, кроме Facebook*. Также эти теги не поддерживаются мессенджером Instagram*. Соответственно, отправка рассылок клиентам Instagram* возможна только в рамках 24-часового окна после последнего сообщения от клиента. Важно! Если тег изменен после запуска рассылки, необходимо обновить сценарий рассылки, нажав на кнопку , иначе изменения не будут применены. Изменения в настройках рассылки, в отличие от изменений в сценарии, применяются сразу (кроме настройки тегов сообщений Facebook*).",
    "meta": {
      "page": 63,
      "section": "7 Подробнее состояния диалогов описаны в Руководстве оператора в разделе «Приложение Б. Статусы"
    }
  },
  {
    "text": "64 При отписке клиента от рассылок отправка запланированных сообщений клиенту не выполняется, кнопки перестают работать. Клиент не получает новые рассылки. Если клиент снова подписывается на рассылки, ранее запущенные рассылки продолжают свою работу: кнопки начинают работать, запланированные сообщения начинают приходить (за исключением тех, которые должны были быть отправлены, когда клиент был отписан). Определение аудитории Аудитория рассылки может быть фиксированной или динамической. Тип аудитории определяется условиями начала рассылки (см. таблицу 3). Таблица 3 — Определение типа аудитории в зависимости от условий начала рассылки Фиксированная аудитория Динамическая аудитория • Начинать сразу после запуска рассылки • Начинать в заданное время • Начинать в заданное время и отправлять равномерно • Начинать при возникновении события для заданной аудитории • Начинать в заданное время и отправлять равномерно (аудитория из внешней системы) • Начинать при выставлении тега • Начинать при возникновении события • Начинать при получении ключевого слова Динамическая аудитория формируется в ходе рассылки — по мере того, как выставляются теги, генерируются события или клиент отправляет ключевое слово. Как- то ограничить ее нельзя. Фиксированная аудитория задается до первого запуска рассылки (в состоянии «Не запущена», см. раздел Возможные состояния рассылки). После запуска рассылки изменить аудиторию полностью или удалить одного из клиентов нельзя. При необходимости запуска на другую аудиторию клиентов рассылку необходимо клонировать, затем задать новую аудиторию, см. подробнее в разделе Изменение условий начала и аудитории для запущенной рассылки. Кроме того, для рассылок с фиксированной аудиторией (не по событию) возможен только один запуск рассылки. После того, как рассылка будет запущена и начнется для всех клиентов, она перейдет в пассивный режим. Начать ее заново (перевести в активный режим) нельзя: при попытке выполнить такую операцию бот увидит, что рассылка уже началась для всей аудитории, необработанных клиентов нет, и переведет ее опять в пассивный режим.",
    "meta": {
      "page": 64,
      "section": "7 Подробнее состояния диалогов описаны в Руководстве оператора в разделе «Приложение Б. Статусы"
    }
  },
  {
    "text": "65 Примечание: В зависимости от условий начала рассылки по-разному наступает событие Start. Если аудитория рассылки фиксирована, то событие Start происходит для всех клиентов одновременно в заданное время или сразу после запуска рассылки, или по событию. Если аудитория рассылки не фиксирована, то событие Start происходит при возникновении внешнего события, при выставлении клиенту тега или отправке клиентом ключевого слова боту. Фиксированная аудитория рассылки задается на вкладке «Целевая аудитория» (см. Рисунок 89). Существует два способа добавления фиксированной аудитории в рассылку: с помощью файлов в формате JSON и CSV. Рисунок 89 — Вкладка «Целевая аудитория» Формат файлов JSON Формат JSON-файла с целевой аудиторией рассылки: { \"customers\": [ { \"id\": <идентификатор клиента в Maxbot>, \"phone\": <телефон>, \"messengers_order\": <порядок следования мессенджеров>, \"timezone\": <часовой пояс клиента>, \"failback_to_sms\": <признак отправки SMS>, \"customer_data\": { \"<название макроса>\": \"<значение макроса>\" } } ], \"macroses\": [ { \"name\": <название макроса>, \"type\": <тип макроса> }",
    "meta": {
      "page": 65,
      "section": "7 Подробнее состояния диалогов описаны в Руководстве оператора в разделе «Приложение Б. Статусы"
    }
  },
  {
    "text": "66 ] } Таблица 4 — Описание полей JSON-файла описания аудитории рассылки Поле Описание Пример использования customers[] Массив клиентов, описание полей каждого клиента приведено ниже. — customers[].id Внутренний идентификатор клиента в Maxbot. Получить его можно, скачав в разделе Выгрузка аудитории файл с клиентами для выбранного бота. 12345 customers[].phone Телефон клиента в формате \"7xxxxxxxxxx\" без + и 8. \"79999999999\" customers[].messengers_order Список мессенджеров по приоритету. Возможные значения: telegram, viber, vkontakte, facebook*, Instagram*. [\"telegram\", \"vkontakte\", \"facebook*\"] customers[].timezone Часовой пояс клиента (см. Приложение А). \"Europe/Moscow\" \"Etc/GMT+3\" \"Japan\"",
    "meta": {
      "page": 66,
      "section": "7 Подробнее состояния диалогов описаны в Руководстве оператора в разделе «Приложение Б. Статусы"
    }
  },
  {
    "text": "customers[].failback_to_sms Логический признак: отправлять ли SMS клиенту, если он еще не подтвердил номер телефона ни в одном из мессенджеров. Для применения этого признака должен быть задан телефон (phone). Необязательное поле, по умолчанию false. Если failback_to_sms = true и клиент не подтвердил номер телефона, то ему будут отправлены заданные в рассылке SMS. Если failback_to_sms = false, и клиент не подтвердил номер телефона, то клиент не будет добавлен в аудиторию рассылки. Если клиент уже подтвердил указанный номер телефона, то по номеру будет определен id, которому и будет отправлена рассылка в соответствии с заданным приоритетом мессенджеров. Для принудительной отправки SMS клиенту можно задать поле false или true",
    "meta": {
      "page": 66,
      "section": "\"UTC\""
    }
  },
  {
    "text": "67 Поле Описание Пример использования messengers_order пустым и выставить failback_to_sms = True. Тогда клиент получит SMS даже если уже подтвердил номер телефона в мессенджерах. customers[].customer_data Значения макросов клиента (см. подробнее о макросах в разделе Использование макросов), задаются в виде пар значений «имя макроса» : «значение макроса». \"name\": \"Mark\" macroses[] Массив описаний макросов. — macroses[].name Название макроса. \"name\" macroses[].type Тип макроса (см. Приложение Б). \"string\" Для каждого клиента должен быть задан: • id либо • phone и messengers_order либо • только phone (если нужно принудительно отправить SMS). Если заданы все три поля, то приоритет имеет id. Пример JSON-файла: { \"customers\": [ { \"id\": 125241, \"timezone\": \"Europe/Moscow\", \"customer_data\": { \"name\": \"John\" } }, { \"phone\": \"79999999999\", \"messengers_order\": [\"telegram\", \"vkontakte\", \"facebook*\"], \"timezone\": \"Europe/Moscow\", \"failback_to_sms\": true, \"customer_data\": { \"name\": \"Mark\" }",
    "meta": {
      "page": 67,
      "section": "\"UTC\""
    }
  },
  {
    "text": "68 } ], \"macroses\": [ { \"name\": \"name\", \"type\": \"string\" } ] } В указанном примере заданы два получателя рассылки. Первый задается по идентификатору в Maxbot (id), второй — по номеру телефона и приоритету мессенджеров (phone + messengers_order). Формат файлов CSV CSV-файл имеет следующий заголовок: customer_id;phone;messengers_order;failback_to_sms;timezone;macros_name1:macros_type1;…; macros_nameN:macros_typeN CSV-файл с аудиторией рассылки обязательно должен: • иметь кодировку UTF8; • содержать заголовок, подобный описанному выше; • использовать в качестве разделителя символ ';'. Таблица 5 — Описание полей CSV-файла описания аудитории рассылки Поле Описание Пример использования customer_id Внутренний идентификатор клиента в Maxbot (аналог id в JSON). 12345 phone Телефон клиента в формате 7xxxxxxxxxx без + и 8. 79999999999 messengers_order Приоритет мессенджеров, аналогично формату",
    "meta": {
      "page": 68,
      "section": "\"UTC\""
    }
  },
  {
    "text": "но задается без кавычек и скобок telegram, vkontakte, facebook*, viber failback_to_sms Логический признак: отправлять ли SMS клиенту, если он еще не подтвердил номер телефона ни в одном из мессенджеров. Аналогично формату JSON. false или true",
    "meta": {
      "page": 68,
      "section": "JSON,"
    }
  },
  {
    "text": "69 Поле Описание Пример использования timezone Часовой пояс клиента (см. Приложение А). Europe/Moscow macros_name:macros_type Произвольное количество столбцов, содержащих значения макросов для клиентов. В названии столбца задается и название макроса, и его тип. name:string price:decimal Пример CSV-файла: customer_id;phone;messengers_order;failback_to_sms;timezone;name:string ;79999999999; viber, telegram, vkontakte, facebook*;true;Europe/Moscow;Sergey 96555;;;true;Europe/Moscow;Max.Expert В приведенном примере задано два получателя рассылки. Первый задан по номеру телефона и приоритету мессенджеров (phone + messengers_order), второй — по идентификатору в Maxbot (customer_id). Экспорт ошибок при загрузке фиксированной аудитории в рассылку При загрузке фиксированной аудитории в рассылку могут возникнуть различные ошибки. Например, может быть указан неверный идентификатор клиента или один клиент может быть указан несколько раз (см. Рисунок 90). При помощи можно раскрыть данные о клиентах, при загрузке которых произошла та или иная ошибка. Но если аудитория рассылки велика, то удобнее скачать CSV-файл с данными клиентов, при загрузке которых произошла ошибка. Рисунок 90 — Пример загрузки данных аудитории рассылки с ошибками",
    "meta": {
      "page": 69,
      "section": "JSON,"
    }
  },
  {
    "text": "70 При нажатии на кнопку «Скачать CSV с ошибками в аудитории» будет загружен файл с идентификаторами «проблемных» клиентов (см. Рисунок 91): Рисунок 91 — Файл с идентификаторами клиентов, при загрузке которых произошла ошибка При загрузке аудитории рассылки также выполняется проверка значений макросов, заданных для клиентов. Например, на рисунке ниже импортируется файл, где для макроса с типом boolean (логический) заданы ошибочные значения (см. Рисунок 92). Рисунок 92 — Файл с ошибочными значениями макросов клиентов При импорте такого файла будет отображено окно с описанием количества найденных ошибок и указания типа ошибки (см. Рисунок 93). Рисунок 93 — Пример загрузки данных аудитории рассылки с ошибками в макросах",
    "meta": {
      "page": 70,
      "section": "JSON,"
    }
  },
  {
    "text": "71 Экспорт статической аудитории рассылок У рассылок со статической аудиторией (как обычных, так и начинающихся по событию) есть возможность скачать аудиторию. Эта функция может быть полезна для переноса аудитории в другую рассылку или для анализа успешности отправки рассылки. Для этого в разделе «Целевая аудитория» рассылки необходимо нажать на кнопку «Скачать» (см. Рисунок 94): Рисунок 94 — Переход к загрузке аудитории рассылки После этого будет открыто окно (см. Рисунок 97), где можно задать опцию «Добавить информацию о статусе отправки для каждого клиента». Рисунок 95 — Загрузка аудитории рассылки После нажатия на кнопку «Скачать» будет получен файл с аудиторией рассылки в формате CSV, поля которого идентичны8 полям загружаемого файла в том же формате. Если была установлена опция «Добавить информацию о статусе отправки для каждого клиента», то в файл будет добавлен столбец «send_status», содержащий один из статусов отправки рассылки для клиента. Возможные значения поля send_status описаны в документации к API консоли маркетолога. Также это поле может быть пустым – это означает, что еще не совершалось попыток начать рассылку для этого клиента.",
    "meta": {
      "page": 71,
      "section": "JSON,"
    }
  },
  {
    "text": "72 Запуск, перезапуск и остановка рассылок Возможные состояния рассылки Любая рассылка может находиться в одном из 4-й состояний: • «Не запущена» — состояние рассылки с момента создания и до первого запуска. В этом состоянии пользователь (маркетолог) разрабатывает сценарий рассылки, задает основные настройки и аудиторию. • «Включена в активном режиме» — в это состояние рассылка переходит поле запуска. В зависимости от настроек условий начала рассылки она начнет выполняться либо сразу, либо при появлении события или тега у клиента, либо при получении ключевого слова от клиента в мессенджере. • «Включена в пассивном режиме» — в этом состоянии выполняются сценарии рассылок, начавшиеся в активном режиме, но не запускаются новые. Если рассылка для фиксированной аудитории началась не для всех клиентов, то продолжаться она будет только для тех, для кого началась, а для оставшихся она уже не начнется. Если рассылка настроена на начало по событию, при выставлении тега клиенту или при получении ключевого слова, то начавшиеся ранее (в активном режиме) сценарии будут продолжать выполняться. Но при появлении новых событий или выставлении тегов или получении ключевых слов рассылка начинаться не будет. Это состояние нужно для того, чтобы дать отработать рассылке для клиентов, для которых она уже началась, но не порождать новые запуски. • «Отключена» — в этом состоянии рассылка не начинается для новых клиентов и не продолжается для тех, для кого она была начата ранее. Иными словами, клиенты не получают новые сообщения рассылки, а нажатия на кнопки в ранее полученных сообщениях не обрабатываются. Это состояние нужно для полного прекращения рассылки. Предполагается, что основные настройки рассылки маркетолог должен выполнять в состоянии «Не запущена», в котором допускается изменение любых опций. После запуска рассылки изменение некоторых настроек становится невозможным (см. таблицу 6). Таблица 6 — Возможности внесения изменений в рассылку в зависимости от ее состояния Состояние Иконка Изменение сценария Изменение условий начала Изменение аудитории Изменение расширенных настроек Не запущена + + + + Включена в активном режиме + — — +",
    "meta": {
      "page": 72,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "73 Состояние Иконка Изменение сценария Изменение условий начала Изменение аудитории Изменение расширенных настроек Включена в пассивном режиме + — — + Отключена + — — + Например, если рассылка включена в активном или пассивном режимах, то изменение условий начала (см. Рисунок 96) или аудитории (см. Рисунок 97) будет невозможно. Рисунок 96 — Невозможно изменить условия начала для включенной в активном/пассивном режиме рассылки Рисунок 97 — Невозможно изменить аудиторию для включенной в активном/пассивном режиме рассылки Можно также заметить, что в состоянии «Отключена» можно изменять сценарий и настройки рассылки. Тем не менее, эти изменения не оказывают никакого воздействия на клиентов, которым эта рассылка была отправлена ранее, т. к. действие рассылки в состоянии «Отключена» полностью прекращено. Запуск рассылки Для запуска рассылки необходимо вызвать меню нажатием на иконку (в списке рассылок или в окне просмотра рассылки).",
    "meta": {
      "page": 73,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "74 Рисунок 98 — Запуск рассылки Для рассылок с фиксированной аудиторией (не по событию) возможен только один запуск рассылки. После того, как рассылка будет запущена и начнется для всех клиентов, она перейдет в пассивный режим. Начать ее заново (перевести в активный режим) нельзя: при попытке выполнить такую операцию бот увидит, что рассылка уже началась для всей аудитории, необработанных клиентов нет, и переведет ее опять в пассивный режим. Рассылки, начинающиеся по событию, по тегу или по ключевым словам, можно переводить в активный режим и из него во все состояния кроме «Не запущена» произвольное количество раз. Запуск нескольких экземпляров одной рассылки для одного клиента При старте более чем одного экземпляра одной рассылки для одного клиента работать в соответствии со сценарием рассылки будет только последний запущенный экземпляр. Все остальные (предыдущие) отключаются: при этом отключается работа кнопок, отключается отправка запланированных сообщений. Иными словами, при повторных запусках рассылки одному и тому же клиенту работает только последний. Во всех предыдущих нажатия кнопок не обрабатываются, запланированные сообщения не отправляются. Например, клиенту отправлена рассылка, изображенная ниже (см. Рисунок 99). Рисунок 99 — Пример рассылки",
    "meta": {
      "page": 74,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "75 После запуска второго экземпляра этой же рассылки для клиента кнопка из первого «Подробнее» из первого запуска работать не будет, а отправка запланированного сообщения будет отменена. Редактирование сценария рассылки без ее остановки Изменение сценария запущенной рассылки возможно как в активном, так и в пассивном состоянии. При этом изменения применяются не сразу по результатам редактирования маркетологом, а только при нажатии на специальную кнопку в окне просмотра рассылки (см. Рисунок 100). Это сделано для того, чтобы промежуточные версии сценария не выполнялись для клиентов, т. к. его редактирование может занять продолжительное время. Рисунок 100 — Изменения сценария рассылки без ее остановки При изменении сценария следует помнить, что новый сценарий будет применен не только для новых запусков рассылки, но и для начатых ранее рассылок. Изменение условий начала и аудитории для запущенной рассылки Если в запущенной рассылке заданы некорректная аудитория или нежелательные условия начала, то для исправления ситуации нужно выполнить следующие действия: 1. Перевести рассылку в состояние «Отключена», нажав на иконку и выбрав в раскрывшемся меню пункт «Отключить». Рисунок 101 — Отключение рассылки 2. Перейти к списку рассылок. 3. В списке рассылок клонировать рассылку, нажав на иконку и выбрав в раскрывшемся меню пункт «Клонировать» (см. Рисунок 102).",
    "meta": {
      "page": 75,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "76 Рисунок 102 — Клонирование рассылки 4. Внести изменения в клонированной рассылке (сценарий, условия запуска, аудитория). 5. Запустить клонированную рассылку. Важно! 1. При клонировании важно не забыть перевести в состояние «Отключена» исходную рассылку, чтобы клиенты не получили обе рассылки. 2. Необходимо внимательно следить за пересечением клиентов в исходной и клонированной рассылках, чтобы избежать отправки двух рассылок одному клиенту. Для этого в клонированной рассылке можно воспользоваться настройкой «Исключить клиентов, добавленных в рассылки». 3. Если рассылка с фиксированной аудиторией начинается по событию, то после клонирования обе рассылки будут начинаться при генерации одного события. Таким образом, для одного клиента могут «сработать» обе рассылки. Чтобы избежать этого, исходную рассылку нужно перевести в пассивный режим или отключить. Настройка SMS-рассылок Регистрация SMS-провайдера Maxbot предоставляет возможность отправки клиенту SMS-рассылок. Отправка SMS осуществляется провайдером, который предоставляет такие услуги. SMS-провайдер — это организация, обеспечивающая отправку и получение коротких сообщений (SMS). Она предоставляет доступ к SMS-шлюзу, при помощи которого Maxbot отправляет SMS- рассылки в центр отправки сообщений мобильного оператора. В текущей версии поддерживается следующие провайдеры: • SMSC (https://smsc.ru/); • МТС (https://mts.ru); • СМС услуги (https://sms-uslugi.ru/); • SMS.ru (https://sms.ru). Компания должна зарегистрировать аккаунт у провайдера, заключить с ним договор и указать данные учетной записи при создании SMS-провайдера в Maxbot.",
    "meta": {
      "page": 76,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "77 Для создания SMS-провайдера в Maxbot необходимо: 1. Перейти в раздел «SMS-провайдеры» и нажать кнопку «+ Создать» в правом верхнем углу (см. Рисунок 103). Рисунок 103 — Переход к добавлению SMS-провайдера 2. Далее необходимо указать данные учетной записи выбранного SMS-провайдера (см. Рисунок 104): • Название — название провайдера, которое будет использоваться в Maxbot; • Описание — произвольный текст о добавляемом провайдере; • Использовать по умолчанию — если флажок установлен, то провайдер будет добавлен во все создаваемые рассылки в качестве SMS-провайдера. Если провайдер по умолчанию не задан, то рассылки создаются без SMS-провайдера; • Тип — выбрать значение «SMS ЦЕНТР», «МТС», «СМС услуги» или «SMS.ru»; • Логин — логин учетной записи выбранного провайдера; • Пароль — пароль учетной записи выбранного провайдера; • Отправитель — название отправителя (от чьего имени клиенты будут получать сообщения). Рекомендуется, чтобы это имя совпадало с тем, что задано в настройках учетной записи самого SMS-провайдера (причем, с учетом регистра). В общем случае это определяется условиями договора с SMS-провайдером.",
    "meta": {
      "page": 77,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "78 Рисунок 104 — Ввод параметров SMS-провайдера 3. Нажать на кнопку «Создать». Примечание: При создании SMS-провайдеров «СМС услуги» и «SMS.ru» есть ряд особенностей, которые описаны в Приложении В и в Приложении Г соответственно. Добавление SMS-провайдера в рассылку После создания SMS-провайдер может быть добавлен в любую рассылку. Это позволит добавить в рассылку SMS-блок и отправлять SMS клиентам, которые еще не подключились к мессенджерам. Для этого необходимо открыть рассылку, перейти в раздел «Условия начала рассылки» и открыть подраздел «Расширенные настройки» (см. Рисунок 105). Примечание: Есть возможность принудительной отправки SMS, даже если клиент уже подключился с использованием мессенджера и подтвердил номер телефона в мессенджере. Для этого",
    "meta": {
      "page": 78,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "79 в файле аудитории (см. раздел Определение аудитории) нужно задать поле messengers_order пустым и выставить failback_to_sms = True. Рисунок 105 — Выбор SMS-провайдера для рассылок Использование SMS-блока в конструкторе После выбора SMS-провайдера в конструкторе рассылки появляется возможность добавить SMS-блок: при нажатии на кнопку «Добавить блок» появляется меню выбора из блоков (см. Рисунок 106). Рисунок 106 — Доступен новый тип блока «SMS-сообщения» SMS-блок добавляется в сценарий так же, как и обычный блок, кроме того, что связь нельзя «снять», а таймаут — изменить (см. Рисунок 107). При запуске рассылки клиенты будут получать либо сообщения в мессенджер (как в обычной рассылке), либо только SMS-блок. Получить и то, и другое клиенты рассылки при запуске не могут. Выбор между SMS или сообщением в мессенджер происходит на основе флага failback_to_sms, задаваемого для каждого клиента отдельно (см. подробнее в разделе Определение аудитории).",
    "meta": {
      "page": 79,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "80 Рисунок 107 — SMS-блок добавлен в сценарий рассылки В рассылке может быть только один SMS-блок, но он может содержать произвольное количество текстовых сообщений, а также ссылку на посадочную страницу для подключения мессенджера и автоматического подтверждения номера телефона (добавляются нажатием на кнопку , см. Рисунок 108). Примечание: Подробнее о посадочных страницах см. в разделе Настройка посадочных страниц для подключения клиентов к боту. Рисунок 108 — Добавление объектов к SMS-блоку Важно! При расчете стоимости рассылки нужно учитывать, что одно сообщение в конструкторе может быть разделено SMS-провайдером на несколько, и, соответственно, тарифицироваться как отправка нескольких сообщений. Стоимость и актуальные лимиты на длину сообщений необходимо уточнять у SMS-провайдера.",
    "meta": {
      "page": 80,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "81 Настройка посадочных страниц в SMS-блоке Добавление ссылки на посадочную страницу (лендинг) позволяет автоматизировать решение основной задачи, для которой предназначены SMS-рассылки — перевод аудитории из SMS в мессенджеры. Каждый клиент SMS-рассылки может получить ссылку на лендинг с уникальным параметром (диплинком), при переходе по которой в любой выбранный мессенджер клиент автоматически подтверждает свой номер телефона (см. подробнее в разделе Механизм подключения клиентов). Примечание: Если лендинг будет использоваться в SMS-блоке рассылок, то при переходе из SMS диплинк, заданный в настройках лендинга, будет заменен на диплинк подтверждения номера телефона. Диплинк, заданный в настройках лендинга, не сработает. Это нужно учитывать при выборе лендинга для SMS-рассылок. Для настройки лендинга в SMS-блоке необходимо: 1. Если лендинг еще не создан — создать его. Подробнее см. описание в подразделе Настройка посадочных страниц для подключения клиентов к боту. 2. В SMS-блоке нажать на кнопку и в меню выбрать пункт «Лендинг подключения к мессенджеру» (см. Рисунок 109). Рисунок 109 — Переход к добавлению лендинга для SMS-блока 3. Задать свойства для лендинга (см. Рисунок 110): • «Посадочная страница» — выбрать один из созданных ранее лендингов; • «Текст до», «Текст после» — задать (необязательно) текст до или после SMS- сообщения; Примечание: Для сокращения расходов на SMS-рассылки в качестве сообщения перед лендингом следует использовать не отдельное сообщение перед ним, а поле «Текст до». Текст, указанный в этом поле, идет в одном SMS-сообщении вместе со ссылкой и при небольшой длине текста необходимо будет оплатить только 1 SMS, а не 2. Аналогично и с полем «Текст после» — оно также идет в одном SMS- сообщении со ссылкой.",
    "meta": {
      "page": 81,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "82 • Время жизни ссылки для подключения к мессенджеру — задать время, в течение которого ссылка будет действительной; если задать «0», то ссылка будет действовать без ограничения времени. Рисунок 110 — Ввод данных для подключения лендинга к SMS-блоку 4. Нажать на кнопку «Сохранить». Вызов внешней системы Как и в остальных блоках рассылки, в SMS-блоке возможен вызов внешней системы. Если вызов завершится ошибкой, то сообщения в SMS-блоке не будут отправлены. При этом, в отличие от остальных блоков, клиенту не будет отправлено сообщение об ошибке, задать его нельзя. Ограничение на использование профиля и идентификаторов диалога В SMS-блоке существует ограничение на использование профиля клиента и идентификатора диалога (thread_id). Профиль клиента — это набор системных переменных, хранящих значения характеристик клиента. thread_id — это системная переменная, содержащая идентификатор диалога, в рамках которого бот выполняет действие рассылки. Обращение к системным переменным профиля осуществляется следующим образом: {{profile.<название переменной>}}, к идентификатору диалога — {{thread.thread_id}}.",
    "meta": {
      "page": 82,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "83 Поскольку при отправке SMS клиента в системе еще не существует, то обращение к профилю из этого блока невозможно, за исключением одной переменной — {{ profile.phone }}. Подробнее об использовании характеристик клиента см. в подразделе  Использование системных переменных. Добавление клиентов Для отправки клиентам SMS-рассылки их необходимо добавить в аудиторию рассылки по номеру телефона с флагом failback_to_sms = true (см. подробнее в подразделе Определение аудитории). Если на момент загрузки аудитории клиент уже подтвердил этот номер телефона, то ему будет отправлена обычная рассылка в мессенджер, в котором он подтвердил этот номер телефона. SMS-блок отправлен не будет. Примечание: Для принудительной отправки SMS клиенту можно задать поле messengers_order пустым и выставить failback_to_sms = true. Тогда клиент получит SMS даже если уже подтвердил номер телефона в мессенджерах. Если клиент был добавлен в рассылку по номеру телефона и на момент загрузки аудитории еще не подтвердил номер телефона, но успел подтвердить его перед запуском рассылки, то ему также будет отправлена обычная рассылка в мессенджер. SMS-блок отправлен не будет. Если клиент подтвердил номер телефона в нескольких мессенджерах, то будет выбран первый в соответствии с заданным в поле messengers_order порядком. При запуске рассылки по событию также указывается флаг failback_to_sms (в интерфейсе флажок «Отправлять SMS, если мессенджеры не используются или клиент не подключен к ним»). Поле «Время ожидания подтверждения номера телефона» при этом должно быть выставлено в 0, иначе будет сгенерировано отложенное событие. Подробнее об этом в подразделе Отправка рассылок по номеру телефона. Также клиенту можно отправить SMS если он подключился к мессенджеру, но отписался от бота в мессенджере. Для этого нужно выставить флаг failback_to_sms (в интерфейсе флажок «Отправлять SMS, если мессенджеры не используются или клиент не подключен к ним») и задать параметр unsubscribed_ttl=0 (в интерфейсе в поле «Время ожидания подписки в мессенджере» задать 0). Подробнее об этом в подразделе «События, отложенные до подписки клиента в мессенджере». При тестовом запуске события (см. Рисунок 111):",
    "meta": {
      "page": 83,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "84 Рисунок 111 — Тестовый запуск события для отправки клиенту SMS Работа с тегами Каждому клиенту может быть задано произвольное количество тегов. При необходимости теги могут сниматься с клиентов. Теги могут использоваться для решения следующих задач: • Запуск рассылки; • Остановка рассылки. Примечание: При работе с тегами следует учитывать, что повторные назначения и снятия тегов не «засчитываются». Т. е. установкой тега считается событие, когда тега не было и он появился; снятием тега — наоборот. Для целей отладки удобно делать рассылки, в которых одна кнопка назначает клиенту тег, а вторая — снимает. Запуск рассылки Тег может быть триггером к запуску рассылки для клиента. Если в условиях начала рассылки задан определенный тег, то будут запущены рассылки для клиентов, которые получат этот тег. Например, в рассылке ниже (см. Рисунок 112) при нажатии на кнопку «Хочу участвовать» клиенту будет присвоен тег StartSpecial2021.",
    "meta": {
      "page": 84,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "85 Рисунок 112 — Рассылка, присваивающая тег клиенту при нажатии на кнопку Примечание: Символ «+» означает, что при нажатии на кнопку тег будет присвоен клиенту. Аналогично в настройках кнопки-действия можно снять тег с клиента. В этом случае тег будет отображаться со знаком «-». Теги со знаками «+» и «-» отображаются только для маркетолога, клиент их не видит). В условиях запуска другой рассылки нужно задать пункт «Начинать при выставлении тега» и указать тег из первой рассылки (StartSpecial2021, см. Рисунок 113). После этого следует запустить вторую рассылку; она будет «ожидать» назначения данного тега. Рисунок 113 — Ввод условия начала второй рассылки В результате при выполнении сценария сначала первой, а затем и второй рассылки (см. Рисунок 114) клиент получит следующие сообщения (см. Рисунок 115).",
    "meta": {
      "page": 85,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "86 Рисунок 114 — Сценарий рассылки №2 и выполняется при нажатии клиентом на кнопку из рассылки №1 Рисунок 115 — Второе сообщение (рассылка №2) получено в результате установки клиенту тега в рассылке №1 Остановка рассылки Тег может являться триггером и к остановке рассылки. Например, в блоке рассылки можно для кнопки назначить тег StopSpecial2021 (cм. Рисунок 116). Рисунок 116 — Установка тега StopSpecial2021 для кнопки «Нет, передумал» Если для данной рассылки в настройке «Останавливать рассылку для клиентов» «Получивших один из тегов» задать тег StopSpecial2021, то после нажатия на кнопку «Нет,",
    "meta": {
      "page": 86,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "87 передумал» она будет остановлена. При данных настройках (см. Рисунок 117) будут также отключены кнопки и запланированные, но еще не отправленные сообщения. Рисунок 117 — Ввод условия остановки рассылки при получении тега Как видно из настроек, рассылка может быть остановлена как при добавлении тега, так и при удалении. Например, если рассылка была ранее запущена при назначении тега StartSpecial2021 (см. пример в разделе Запуск рассылки), то можно остановить ее путем снятия этого тега (см. Рисунок 118). Соответственно, в блок сообщений рассылки, нужно будет добавить кнопку, снимающую данный тег с клиента. Рисунок 118 — Ввод условия остановки рассылки при снятии тега Примечание: При помощи одной кнопки можно устанавливать и снимать сразу несколько тегов.",
    "meta": {
      "page": 87,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "88 Если при попытке удалить у клиента тег оказывается, что тег был удален ранее, или никогда не выставлялся (т .е. тега нет), то рассылка не будет остановлена. Наличие тега остановки рассылки не мешает запуску новых рассылок для этого клиента. Важно, чтобы тег был установлен или снят (для случая, когда настроено «Останавливать рассылку для клиентов, у которых удален один из тегов») именно после запуска рассылки. Управление тегами клиентов В разделе «Теги» (см. Рисунок 119) перечислены все теги, использующиеся в рассылках. Рисунок 119 — Просмотр тегов При этом отдельного способа создать новый тег нет. Теги создаются автоматически при их упоминании: • в настройках кнопок-действий (см. Рисунок 120); • в настройках условия запуска рассылки (см. Рисунок 121).",
    "meta": {
      "page": 88,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "89 Рисунок 120 — Создание тега при настройке кнопки-действия Рисунок 121 — Создание тега при настройке условий запуска рассылки Плюс (+) справа от названия тега говорит о том, что при нажатии на Enter тег будет создан и добавлен в соответствующее поле. Удалять теги из консоли маркетолога нельзя. Однажды добавленный тег не может быть удален, т. к. в общем случае нельзя гарантировать, что в одной из запущенных когда-то рассылок этот тег не будет выставляться или сниматься. Клиентам теги могут добавляться и удаляться двумя способами: • клиентом самостоятельно — в результате нажатий на кнопки в сообщениях рассылки (см. подробнее в подразделе Настройка сценария рассылки); • компанией — в результате выполнения API-запроса (см. запрос «Изменение тегов клиентов» в разделе API консоли маркетолога).",
    "meta": {
      "page": 89,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "90 Фильтрация клиентов (сегментирование) При выгрузке аудитории (см. раздел Выгрузка данных для выбранного бота) в одноименном разделе помимо прочих данных о клиентах выгружается и список тегов (см. Рисунок 122). Это позволяет сегментировать аудиторию по признаку наличия или отсутствия некоторого тега или тегов. Рисунок 122 — Список тегов клиента в файле аудитории бота Использование событий Общая информация о событиях События могут являться триггером к началу рассылки для клиента. Это удобно для решения некоторых маркетинговых задач. Например, можно создать событие «Клиент воспользовался услугой» и генерировать его при оплате клиентом услуги. Получив информацию о событии, бот может запустить одну или несколько рассылок этому клиенту: контроль качества через несколько дней, повторное предложение услуги со скидкой через месяц и т. д. События делятся на два типа: 1. Системные: • Добавление нового клиента; • Подтверждение номера телефона. 2. Пользовательские. Системные события Системные события генерируются, когда клиент отправляет сообщение боту в первый раз, либо подтверждает номер телефона. Их нельзя удалить или изменить. Важно! Системные события срабатывают для всех клиентов, которые подключились к боту или подтвердили номер телефона. При тестировании таких рассылок нужно быть очень",
    "meta": {
      "page": 90,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "91 аккуратным и учитывать, что эти события могут происходить одновременно у многих реальных клиентов. Тестирование таких рассылок лучше производить с использованием отдельного тестового события, и потом только переключать рассылку на начало по системным событиям. Иными словами, аудитория может оказаться шире, чем изначально кажется маркетологу.  И рассылка будет затрагивать всех будущих клиентов, которые подключатся или подтвердят номер телефона. Соответственно, лучше проверить такую рассылку заранее на другом событии и уже потом переключиться на нужное. Пользовательские события Пользовательские события могут генерироваться из другой рассылки или с помощью специального вызова API (см. подробнее запросы группы «Генерация событий» в разделе API консоли маркетолога). Пользовательские события можно создавать и удалять из интерфейса консоли маркетолога (см. Рисунок 123). Рисунок 123 — Переход к добавлению пользовательского события При создании события задается его идентификатор, имя и аргументы (см. Рисунок 124). Идентификатор события используется при генерации события. Имя используется для отображения события в интерфейсе, например, при выборе события в условиях запуска рассылки.",
    "meta": {
      "page": 91,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "92 Рисунок 124 — Ввод аргументов события Аргументы позволяют передавать дополнительную информацию при генерации события. Например, у системного события «Подтверждение номера телефона» есть аргумент phone_number — номер телефона, который подтвердил клиент. При создании пользовательских событий в них может быть добавлено произвольное число аргументов. Например, для события «Клиент воспользовался услугой» можно добавить аргументы «Дата оказания услуги» и «Мастер, который оказывал услугу». Эти аргументы можно будет использовать в текстах сообщений, кнопках рассылки и других текстовых полях аналогично макросам. Таким образом, можно создавать персонифицированные для каждого клиента рассылки. Редактирование событий После создания пользовательского события маркетолог может произвольно редактировать все доступные поля и удалить его. Если хотя бы одна рассылка настроена на старт по данному событию, то его удаление запрещено, редактирование названия и идентификатора рассылки разрешено. Редактирование и удаление аргументов события ограничено созданными в рассылке макросами. Если аргумент события не используется в рассылке, то его можно удалять и изменять. Если используется, то доступно только изменение названия аргумента. Если хотя бы одна из рассылок, настроенных на старт по данному событию, запущена, то редактирование всех полей события и его аргументов запрещено.",
    "meta": {
      "page": 92,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "93 Тестирование рассылок, запускаемых по событию В интерфейсе консоли маркетолога предусмотрена возможность генерации событий в целях тестирования. Для этого можно нажать кнопку «Сгенерировать событие» в разделе «События» напротив выбранного события (см. Рисунок 125) или на странице самого события (см. Рисунок 126). Рисунок 125 — Кнопки генерации событий в списке Рисунок 126 — Кнопка генерации события на странице события",
    "meta": {
      "page": 93,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "94 После генерации события с использованием интерфейса Marketer в области «Список launch_result_ids» отображаются специальные ссылки (см. Рисунок 127), позволяющие перейти к отладке рассылки. Рисунок 127 — Сгенерировано событие с идентификатором запуска (launch_result_id) При переходе по ссылке отображается интерфейс отладки (см. подробнее раздел Отладка), в котором применен фильтр по выбранному идентификатору запуска (launch_result_id), см. Рисунок 128. Рисунок 128 — Просмотр результатов генерации события в разделе «Отладка»",
    "meta": {
      "page": 94,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "95 Для передачи информации о запросе разработчикам компании, например, для интеграции с CRM, удобно использовать кнопки копирования запроса в формате curl (см. Рисунок 129). Рисунок 129 — Кнопки для копирования запроса в формате curl При генерации событий при помощи интерфейса консоли маркетолога система не даст ввести значения аргументов, не соответствующие их типу. При генерации событий при помощи API-вызовов также выполняется проверка соответствия типов аргументов. Например, при вызове события с некорректным значением аргумента vip: curl -X POST -H \"Content-Type: application/json\" -H \"Authorization: Bearer Contoso_:eyJoXfD saJkKrsGFH...\" -d '{ \"customer_messenger_id\": 13561, \"event_name\": \"numeric_code_for_client\", \"arguments\": { \"code\": 133442, \"discount\": 15, \"vip\": \"no\" } }' \"https://mailing-factory.dev.maxbot.ai/v1/event\" сервер вернет ответ с HTTP-статусом 409:",
    "meta": {
      "page": 95,
      "section": "8 За исключением случая, когда макрос не используется в рассылке. В этом случае исходный тип макроса"
    }
  },
  {
    "text": "96 События, отложенные до подтверждения клиентом номера телефона При генерации событий описанным выше запросом рассылка для указанного в ней клиента стартует сразу после получения запроса. Если клиента с таким идентификатором не найдено, то рассылка не будет запущена. В некоторых случаях удобно иметь возможность отложить запуск рассылки для клиентов, которые еще не подключились к боту, и, соответственно, не имеют идентификатора. Например, когда компании выгодно подключать клиентов к боту для ведения дальнейшей коммуникации, и клиентам предлагается скидка, но только в том случае если они подключатся к боту и подтвердят в нем свой номер телефона. В этом случае компания может сгенерировать отложенное событие, указав не идентификатор клиента, а его номер телефона. Бот будет ждать заданное время (ttl, англ. time to live; настройка в интерфейсе называется «Время ожидания подтверждения номера телефона» и задается в секундах, см. Рисунок 130), и если клиент за это время подтвердит свой номер телефона, то событие будет сгенерировано и рассылка для него начнется. Рисунок 130 — Генерация отложенного события подтверждения номера телефона Если клиент с таким номером телефона уже есть, то он сразу получит рассылку, несмотря на приоритет мессенджеров (например, если по приоритету Facebook* первый, ВКонтакте второй, а Telegram* третий, но клиент не подтвердил номер в Facebook*, то",
    "meta": {
      "page": 96,
      "section": "HTTP/2 409"
    }
  },
  {
    "text": "97 рассылка уйдет во ВКонтакте. Среди мессенджеров, где телефон подтвержден, приоритет учитывается). Примечание: Сгенерировать отложенное событие также можно при помощи API-вызова, задав ненулевой параметр ttl (см. запрос «Генерация события по номеру телефона» в разделе API консоли маркетолога). События, отложенные до подписки клиента в мессенджере Клиенты всех поддерживаемых мессенджеров имеют возможность отписаться от получения сообщений от бота в мессенджере (не следует путать с отпиской от всех рассылок на уровне Maxbot). Это приводит к невозможности отправлять таким клиентам какие-либо сообщения. В некоторых случаях может быть целесообразно подождать, пока клиент подпишется обратно. Например, когда клиенту предлагают присылать информацию о статусе сделанного заказа. Для этого предназначен второй тип ожидания — ожидание подписки клиента в мессенджерах; это время также задается в секундах (см. Рисунок 131). Рисунок 131 — Генерация отложенного события ожидания подписки в мессенджере Примечание: Данный тип ожидания может быть задан как в запросе генерации отложенного события, так и в запросе генерации обычного события по идентификатору клиента. Для указания задержки используется параметр запроса unsubscribed_ttl (настройка в интерфейсе —",
    "meta": {
      "page": 97,
      "section": "HTTP/2 409"
    }
  },
  {
    "text": "98 «Время ожидания подписки в мессенджере»). Подробнее об этом см. в описании API- запросов группы «Генерация событий» в разделе API консоли маркетолога. Рисунок 132 — Генерация отложенного события ожидания подписки в мессенджере (по идентификатору клиента) Если клиент подписывается в мессенджере в течение указанного времени, то для него начинается рассылка. Если не успевает, то рассылка не начинается, событие считается просроченным. Примечание: Клиенту можно отправить SMS если он отписался от бота в мессенджере. Для этого нужно выставить флаг failback_to_sms (в интерфейсе флажок «Отправлять SMS, если мессенджеры не используются или клиент не подключен к ним») и задать параметр unsubscribed_ttl=0 (в интерфейсе в поле «Время ожидания подписки в мессенджере» задать 0). Если при этом задать параметр unsubscribed_ttl > 0, то бот начнет ожидание подписки в мессенджере, SMS рассылка не начнется. Отправка рассылок по номеру телефона В некоторых случаях неудобно генерировать событие указывая идентификатор клиента. Для таких случаев можно указать номер телефона, время ожидания подтверждения номера телефона = 0 и приоритет мессенджеров. В этом случае бот запустит рассылку, настроенную на начало по указанному событию, для клиента с указанным номером телефона. Если клиент подтвердил свой номер в нескольких мессенджерах, то будет взят первый по заданному приоритету. Если нет клиентов, которые подтвердили указанный номер телефона, то рассылка не начнется ни для кого из клиентов.",
    "meta": {
      "page": 98,
      "section": "HTTP/2 409"
    }
  },
  {
    "text": "99 Рисунок 133 — Отправка рассылки по номеру телефона с указанием приоритета мессенджеров Отправка рассылок по номеру телефона и отложенные события отличаются только параметром «Время ожидания подтверждения номера телефона». Внутренний механизм и запрос API-запрос одинаковы (см. запрос «Генерация события по номеру телефона» в разделе API консоли маркетолога). Примечание: При отправке SMS-рассылок флажок «Отправлять SMS если мессенджеры не используются или клиент не подключен к ним» должен быть установлен, поле «Время ожидания подтверждения номера телефона» должно быть установлено в 0, рассылка должна содержать SMS-блок. Статусы событий Часто вызывающей стороне нужно знать, чем закончилась генерация события: началась ли для клиента рассылка; если да, то какая, когда и т. д. Для этого предусмотрены статусы событий, которые можно получить, обработав ответ на запрос генерации событий. При генерации событий в ответе на запрос возвращаются идентификаторы запусков (flow), или идентификаторы отложенных событий.",
    "meta": {
      "page": 99,
      "section": "HTTP/2 409"
    }
  },
  {
    "text": "100 Если событие сгенерировано по идентификатору клиента или по номеру телефона, и клиент с указанным номером уже существует, то в ответе на запрос генерации события возвращается список launch_customer_ids с идентификаторами запусков рассылок. Информацию по каждому запуску можно получить с помощью API-запроса (см. запрос «Получение статуса запуска рассылки» в разделе API консоли маркетолога). Использование макросов Макросы позволяют персонифицировать рассылки для клиентов. Например, можно создать рассылку (см. Рисунок 134), в тексте которой используются два макроса: • customer_name — имя и отчество клиента; • customer_discount — персональная скидка. Рисунок 134 — Рассылка, использующая два макроса Далее можно использовать файл аудитории, в котором заданы значения для используемых макросов. Например, файл в формате JSON может иметь следующий вид: { \"customers\": [ { \"id\": 13561, \"timezone\": \"Europe/Moscow\", \"customer_data\": { \"customer_name\": \"Дмитрий Владимирович\", \"customer_discount\": \"15\" } }, { \"phone\": \"79999999999\", \"messengers_order\": [\"telegram\", \"vkontakte\", \"facebook*\"], \"timezone\": \"Europe/Moscow\", \"failback_to_sms\": false, \"customer_data\": { \"customer_name\": \"Владимир Валерьевич\", \"customer_discount\": \"10\"",
    "meta": {
      "page": 100,
      "section": "HTTP/2 409"
    }
  },
  {
    "text": "101 } } ], \"macroses\": [ { \"name\": \"customer_name\", \"type\": \"string\" }, { \"name\": \"customer_discount\", \"type\": \"string\" } ] } Каждому клиенту из аудитории рассылки можно задать свои значения, таким образом, сделав рассылку уникальной для каждого клиента. После запуска клиенты получат рассылку, в которой бот обратится к ним по именам, а также укажет для каждого из них размер персональной скидки (для первого клиента 15%, для второго — 10%). Поля, в которых можно использовать макросы Макросы можно использовать почти во всех текстовых полях конструктора рассылок: • Тексты сообщений; • Заголовки кнопок; • URL для кнопок-ссылок; • URL для медиа-контента; • Сообщения при переводе в канал; • Большинство полей настроек вызова внешней системы (кроме названий заголовков запроса и названий параметров запроса); • Аргументы события при генерации событий; • Все текстовые поля SMS-блока и настройки вызова внешней системы в SMS-блоке • Многие текстовые поля других действий9.",
    "meta": {
      "page": 101,
      "section": "HTTP/2 409"
    }
  },
  {
    "text": "102 Создание и удаление макросов рассылки Явного способа создания и удаления макросов в рассылке нет. Макросы создаются при упоминании в одном из перечисленных ранее полей. Макрос может состоять из латинских букв, цифр, подчеркивания и обрамляется двойной фигурной скобкой. Маркетолог может создать рассылку и в первом же сообщении написать «{{ abc }}». В этом случае в рассылке будет создан макрос abc. Если маркетолог удалит этот макрос из всех текстовых полей, то макрос удалится. Проверка наличия макросов В консоли маркетолога реализована система проверки наличия макросов, целью которой является не дать маркетологу запустить рассылку, в которой для клиентов не заданы какие-либо макросы, либо неверно определены их значения. При этом значения макросов в файле аудитории могут быть и пустыми. Проверки работают следующим образом: 1. Если аудитория задается статично, то пока ни одного клиента не задано в рассылку можно добавлять любые макросы. Однако, при загрузке аудитории все заданные макросы должны быть у всех добавляемых в рассылку клиентов. Иначе при загрузке аудитории маркетолог увидит ошибку. 2. Если аудитория задается статично, и аудитория рассылки уже задана, то в рассылку можно добавлять только те макросы, значения которых есть у всех клиентов из аудитории рассылки. При попытке использовать в тексте отсутствующий хотя бы у одного клиента макрос маркетолог получит ошибку. 3. Если рассылка начинается при выставлении тега или при получении ключевого слова, то использование макросов недопустимо. Т. к. нет способа задавать значения этих макросов. 4. Если рассылка начинается при возникновении события, то в рассылку можно добавлять только макросы, названия которых совпадают с именами аргументов события, по которому стартует рассылка. При попытке использовать другой макрос возникнет ошибка. При попытке удалить аргумент события, который используется в рассылке, возникнет ошибка. При попытке сменить событие, по которому запускается рассылка, требуется чтобы у нового события были все аргументы, которые используются в рассылке. 5. Если рассылка имеет фиксированную аудиторию и начинается по событию, то макросы берутся и из фиксированной аудитории, и из аргументов события. При этом они не могут пересекаться, т. е. нельзя загрузить аудиторию с определенным макросом и использовать одноименный аргумент в событии.",
    "meta": {
      "page": 102,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "103 Определение значений макросов для клиентов Для рассылок со статической аудиторией значения макросов задаются в JSON или CSV- файлах, определяющих аудиторию рассылки. Для рассылок, начинающихся по событию, значения макросов передаются в аргументах события. Например, если рассылка началась по событию «Создание промокода для клиента» (см. Рисунок 135), то в теле рассылки могут быть использованы макросы {{code}}, {{discount}} и {{valid_thru}}. Рисунок 135 — Аргументы события являются макросами для рассылки Использование системных переменных Профиль клиента Иногда необходимо получить некоторые системные переменные для клиента. Например, его идентификатор для передачи его во внешнюю систему. В этом случае можно выполнить обращение к профилю клиента. Доступные поля: • maxbot_id — идентификатор бота; • maxbot_name — название бота; • company_name — название компании; • external_messenger_id — идентификатор (id) в Viber. Тип string; • messenger_type — тип мессенджера; • messenger_id — идентификатор (id) в мессенджерах (кроме Viber). Тип integer. Для Viber это значение генерируется в боте.",
    "meta": {
      "page": 103,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "104 • customer_messenger_id — идентификатор клиента в Maxbot; • phone — подтвержденный номер телефона клиента. None, если нет подтвержденного номера. Примечание: В SMS-блоке доступна только одна переменная — profile.phone. Обратиться к переменным можно следующим образом: {{ profile.<field> }} Например, {{ profile.customer_messenger_id }} Идентификатор диалога Идентификатор диалога, в рамках которого бот выполняет действие рассылки, содержится в системной переменной thread.thread_id. Эта переменная недоступна в SMS-блоке. Действия рассылки в рамках одного запуска (launch) выполняются в разных диалогах. Например, при выполнении рассылки (см. Рисунок 136) будут сгенерированы 3 различных идентификатора, т. к. после выполнения каждого действия бот будет закрывать диалог. Рисунок 136 — Пример рассылки, которая генерирует 3 различных thread_id Соответственно, клиент при выполнении данной рассылки получит сообщения следующего вида: Рисунок 137 — Отображение thread_id у клиента",
    "meta": {
      "page": 104,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "105 Использование макросов в настройках вызова внешней системы и в действии генерации события В настройках вызова внешней системы и в действии генерации события использование макросов имеет ряд особенностей. В полях настроек вызова внешней системы: • Адрес; • Текст сообщения в случае ошибки; • Значение заголовка запроса макросы задаются как обычно, в двойных фигурных скобках. Например: {{ macros_1 }} Пример заполнения показан на рисунке ниже (см. Рисунок 138): Рисунок 138 — Использование макросов при вызове внешней системы Поля настройках вызова внешней системы: • Значение параметра запроса; • Тело запроса",
    "meta": {
      "page": 105,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "106 а также аргументы генерируемых из рассылки событий являются вычислимыми jinja- выражениями, и параметры запросов задаются там с приставкой «slots.m.» и без фигурных скобок: slots.m.macros_1 Так, например, можно задать следующее тело запроса: { \"Macros 1\": slots.m.macros_1, \"Macros 2\": slots.m.macros_2, \"Some details\":[ profile.customer_messenger_id, profile.messenger_type, slots.m.macros_3 ] } Или аргумент события: Рисунок 139 — Определение аргумента для события Опрос клиентов с помощью форм Маркетолог может проводить опросы клиентов с целью сбора информации, требуемой ему или подразделениям компании. Для этого в Maxbot используется специальный блок рассылки – форма. Для добавления формы в рассылку необходимо открыть конструктор рассылки, нажать на кнопку «Добавить блок» и выбрать пункт «Форма» (см. Рисунок 140).",
    "meta": {
      "page": 106,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "107 Рисунок 140 — Добавление формы в рассылку После этого в конструкторе появится новый блок (см. Рисунок 141): Рисунок 141 — Форма добавлена в рассылку Форма состоит из набора вопросов, которые бот задает клиенту в заданной последовательности. Пример такой формы показан на рисунке ниже: Рисунок 142 — Экран настройки формы Общие правила при работе форм При взаимодействии клиента с формой в общем случае выполняется следующий сценарий: 1. Бот задает клиенту вопросы формы и ждет ответа некоторое время.",
    "meta": {
      "page": 107,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "108 2. Когда клиент отвечает, бот проверяет соответствует ли ответ клиента заданному типу вопроса (например, число или email). 3. Если ответ клиента соответствует типу вопроса, то бот сохраняет ответ и задает следующий вопрос. 4. Если ответ не соответствует типу вопроса, то бот задает вопрос повторно. 5. Когда все вопросы заданы, бот отправляет клиенту результаты опроса – перечисляет вопросы, данные на них ответы и просит клиента подтвердить их, либо исправить неточности. 6. После подтверждения клиента бот записывает ответы в специальные переменные (слоты), к которым можно обратиться в сценарии рассылки. Например, чтобы отправить их в компанию с помощью вызова внешней системы. 7. Далее сценарий рассылки продолжается в соответствии с теми действиями, которые заданы для выхода при успешном заполнении формы. Далее будут описаны детали реализации приведенного сценария, а также дополнительные возможности и неуспешные сценарии при обработке ответов клиента. Типы вопросов Тип вопроса определяет то, какой ответ бот будет принимать от клиента. Поддерживаются вопросы следующих типов: • Короткий текст – в ответ принимается любая последовательность символов; • Email – в ответ принимаются адреса электронной почты вида customer@example.com; • Число – в ответ принимаются положительные и отрицательные вещественные числа; • Телефон – номер телефона как последовательность 11 цифр. При этом бот не будет просить подтвердить отправленное ему значение; • Файл – в ответ принимаются один или несколько файлов. В текущей версии Maxbot принимаются только изображения. • Дата – принимаются различные форматы дат: «11.12.2021», «10 декабря», «завтра». При этом клиент может указать дату из прошлого. • Варианты ответа – маркетолог задает фиксированный набор вариантов ответа в настройках вопроса, клиент может выбрать один из этих вариантов. При получении ответа клиента бот будет пытаться выделить необходимые данные из его ответа. Например, если вопрос типа «Email», то клиент может ответить: Моя почта customer@example.com В этом случае бот сохранит только «customer@example.com». Если на вопрос типа «Телефон» клиент ответит: Мой телефон +7 (999) 999-99-99 и второй +7 931 1111111",
    "meta": {
      "page": 108,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "109 то бот сохранит в качестве ответа «79999999999» – первое подходящее значение. Ниже в таблице описаны особенности сохранения ответов на вопросы различных типов. Таблица 7 – Правила сохранения ответов на вопросы различных типов Тип вопроса Правила сохранения ответа Короткий текст Ответ сохраняется как есть, целиком (весь текст, введенный клиентом) Email Выделяется первый найденный в тексте email, остальное отбрасывается Число Выделяется первое число со знаком и вещественной частью, остальное отбрасывается Телефон Выделяется первый указанный номер телефона и сохраняется в формате «7xxxxxxxxxx» (без плюса, пробелов и других разделителей, независимо от того, как его указал клиент) Файл Файлы, отправленные клиентом, сохраняются в файловом хранилище. В качестве ответа на вопрос типа «Файл» бот хранит список ссылок (URL) на отправленные клиентом файлы Дата Выделяется первая указанная дата и сохраняется в формате «YYYY-MM-DD», например, «2021-11-27». Варианты ответа Выделяется один из заданных в настройках вопроса вариантов. Предполагается, что клиенты будут пользоваться предложенными кнопками с вариантами ответов. Даже если клиент ответит текстом с неточной формулировкой, бот будет пытаться выделить из текста вариант ответа и сохранит только его. Например, если есть вариант ответа «Банковская карта», и клиент напишет «Наверное, банковской картой», то в качестве ответа будет записано «Банковская карта». Примечание: Если вопрос необязательный, и он пропущен, то в ответ будет записано None. Основные настройки вопросов Маркетолог задает тип вопроса и его настройки при добавлении вопроса на форму. Для этого нужно: 1. Нажать на форме на кнопку . 2. В открывшемся окне нажать на кнопку «Добавить вопрос» и выбрать тип вопроса из предложенного списка (см. Рисунок 143).",
    "meta": {
      "page": 109,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "110 Рисунок 143 — Выбор типа добавляемого вопроса 3. Добавленный вопрос появится в списке слева. Справа необходимо задать настройки вопроса. К основным настройкам вопроса относятся: • Идентификатор ответа на вопрос – уникальный идентификатор, по которому можно будет получить ответ клиента на этот вопрос. Подробнее об этом в см. разделе Использование ответов на вопросы. • Вопрос – текст вопроса, который бот отправит клиенту в мессенджер. Для вопросов всех типов, кроме «Короткий текст», рекомендуется формулировать, что ожидается от клиента. Например, не задавать вопрос «Когда вы хотите записаться на наши услуги?», что подразумевает разные ответы вида «В следующем месяце», «В конце недели», а явно просить указать день, например: «Укажите, пожалуйста, какого числа вы хотели бы записаться на наши услуги?». • Краткое описание вопроса – сжатое, но емкое описание, позволяющее и клиенту, и маркетологу идентифицировать вопрос. Например, «Имя», «Возраст» или «Телефон». Маркетолог видит краткое описание вопроса в списке вопросов слева (см. Рисунок 144). Клиент увидит краткое описание вопроса при переходе в меню формы и при просмотре результатов заполнения формы, когда будет проверять правильность ответов. • Опция «Обязательный вопрос» – если установлена, то клиент не может пропустить этот вопрос и должен дать подходящий ответ. Если опция не установлена, то появляется кнопка «Пропустить этот вопрос»:",
    "meta": {
      "page": 110,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "111 Рисунок 144 — Основные настройки вопроса Отправка медиа-контента вместе с вопросом Как и в сообщениях обычных блоков, к каждому вопросу можно добавить один или несколько файлов, которые будут отправлены клиенту перед текстом вопроса. Для этого необходимо: 1. Перейти на вкладку «Медиа». 2. Нажать на кнопку . 3. Выбрать тип добавляемого файла (см. Рисунок 145) и добавить нужные файлы при помощи кнопки . Также можно вставить ссылку на файл, если он уже загружен. Рисунок 145 — Добавление медиа-контента к вопросу",
    "meta": {
      "page": 111,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "112 Настройка условий отправки вопросов Форма позволяет настраивать условия, при которых вопросы отправляются клиенту. Это полезно, если вопрос уместно задавать только в некоторых случаях. Например, если клиент поставил низкую оценку за качество обслуживания, можно спросить у него, что именно ему не понравилось. Но не нужно задавать этот вопрос, если поставлена максимальная оценка (см. Рисунок 146). При этом есть очевидное ограничение – условный вопрос должен располагаться в списке после вопроса, ответ на который проверяется. Важно! Если вопрос, ответ на который проверяется, был пропущен клиентом, то будут срабатывать все условия «Не равно» при любом значении, с которым происходит сравнение. Рисунок 146 — Добавление вопроса, который будет задан при выполнении определенного условия Выход клиента из формы Если форма показана клиенту, то у него есть 4 основных варианта выхода из нее: 1. Успешный выход при ответе на все обязательные вопросы. Это происходит, когда клиент подтверждает правильность ответов на все вопросы. Если в этом случае необходимо продолжить рассылку, то нужно соединить зеленый выход из формы со следующим блоком (см. Рисунок 147).",
    "meta": {
      "page": 112,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "113 Рисунок 147 — Продолжение рассылки при успешном выходе клиента (ответе на все обязательные вопросы) 2. Выход по таймауту. Происходит автоматически, когда клиент перестает отвечать на вопросы формы. Задержка задается в настройках формы. Если в этом случае необходимо продолжить рассылку, то нужно соединить фиолетовый выход из формы со следующим блоком (см. Рисунок 148). Рисунок 148 — Продолжение рассылки при выходе по таймауту Примечание: Если таймаут выхода из формы превышает таймаут диспетчера диалогов (время, через которое бот автоматически деактивирует бездействующий навык), то бот будет ожидать время, заданное для таймаута выхода из формы. 3. Выход по желанию клиента. Клиент может отказаться от ответов на вопросы и выйти из формы. Для этого он должен перейти в меню и нажать «✕ Выйти», либо отправить «стоп», «прекрати», «хватит» и т. д. в любом контексте формы.",
    "meta": {
      "page": 113,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "114 Если в этом случае необходимо продолжить рассылку, то нужно соединить желтый выход из формы со следующим блоком (см. Рисунок 149). Рисунок 149 — Продолжение рассылки при выходе по желанию клиента 4. Выход при отправке нескольких ответов, не соответствующих типу вопроса. Например, если на вопрос формы типа «Email» клиент не указывает email три раза подряд, то бот закончит опрос и оправит клиенту сообщение: К сожалению, не удалось получить подходящий по формату ответ. Опрос завершен, спасибо! Это сообщение и количество попыток (три) в текущей версии не изменяемы. Настроить выполнение других действий в рассылке после этого исхода в текущей версии также невозможно. Вызов внешней системы, в отличие от всех остальных случаев, в текущей версии не выполняется и не настраивается. Возможен и дополнительный, более сложный сценарий выхода клиента из формы. Сначала клиент получает рассылку следующего вида (см. Рисунок 150), где при нажатии на кнопку происходит перевод клиента в некоторый канал. Рисунок 150 — Рассылка с переводом в канал Далее клиент получает рассылку с формой, после чего начинает ее заполнять. Если в процессе ответов на вопросы формы клиент по каким-то причинам нажмет на кнопку перевода в канал в другой рассылке («Это интересно!» на рисунке выше), то бот переведет клиента в канал, а заполнение формы будет завершено.",
    "meta": {
      "page": 114,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "115 При этом выполнится вызов внешней системы как при выходе по желанию клиента (подробнее об этом ниже), но другие действия рассылки с формой, связанные с выходом из формы, выполняться не будут. Настройки формы Помимо самих вопросов маркетолог может задать настройки, относящиеся к форме в целом. Для изменения настроек формы нужно нажать на кнопку на блоке формы . На вкладке «Основные» (см. Рисунок 151) можно задать следующие настройки: • Идентификатор формы – в текущей версии Maxbot не используется. • Время ответа на каждый вопрос формы – спустя заданное количество секунд после последнего сообщения от клиента сработает выход из формы по таймауту. Рисунок 151 — Основные настройки формы На вкладке «Сообщения» (см. Рисунок 152) можно задать тексты сообщений, которые отправляются клиентам перед первым вопросом, при работе с меню формы и при выходе из формы. Если текст какого-либо сообщения не задан, то оно отправляться не будет. Важно! После внесения любых изменений в тексты форм или вопросов необходимо обязательно проверить работу рассылки, чтобы убедиться в согласованности текстов друг с другом. Из настроек форм это не всегда видно, что может привести к нежелательным результатам.",
    "meta": {
      "page": 115,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "116 Рисунок 152 — Настройка сообщений формы Вызов внешних систем Форма поддерживает выполнение нескольких вызовов внешних систем в разных случаях. Для открытия настройки вызова (см. Рисунок 153) нужно нажать на кнопку на блоке формы. Рисунок 153 — Настройка вызовов внешней системы из формы Вызов внешней системы «При входе на форму» происходит перед отправкой первого вопроса и возможного сообщения перед ним. Если вызов завершается успешно, форма начинает выполняться.",
    "meta": {
      "page": 116,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "117 Если вызов завершается ошибкой, то форма не выполняется. Клиент получит сообщение об ошибке, если оно задано в настройках вызова внешней системы. Все остальное аналогично вызову внешней системы в обычных блоках (подробнее см. в разделе Вызов внешней системы). Остальные вызовы внешней системы происходят при соответствующих им выходах. Кроме того, вызов внешней системы по желанию клиента происходит и тогда, когда клиент переходит в канал в процессе заполнения формы. Использование ответов на вопросы Задача форм – получить от клиентов некоторые данные. К собранным данным можно обращаться аналогично макросам рассылки. Там, где используются jinja-шаблоны, нужно указывать: {{ form.<идентификатор_ответа_на_вопрос> }} Например, в сообщениях рассылки: Рисунок 154 — Использование ответа на вопрос в блоке рассылки Примечание: Идентификатор ответа задается в настройках вопроса, см. подробнее в подразделе Основные настройки вопросов. Там, где используются jinja-выражения, нужно использовать slots.<идентификатор_ответа_на_вопрос> Например (см. Рисунок 155):",
    "meta": {
      "page": 117,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "118 Рисунок 155 — Использование ответа на вопрос при вызове внешней системы Таким образом, можно передавать все ответы клиента во внешнюю систему при любом10 выходе из формы, указав их в теле и/или параметрах запроса при вызове внешней системы. Если совершен выход по таймауту или по желанию клиента, то ответы будут только у тех вопросов, на которые успел до этого ответить клиент. В ответах на остальные вопросы будет None. Подобные jinja-шаблоны и jinja-выражения можно использовать во всех остальных действиях рассылки, где предусмотрено использование макросов: при генерации событий из рассылки, при генерации интентов, переводе в канал, отправке сообщений и т. д. Особо стоит описать ответы на вопросы типа «Файл». Ответом в данном случае является список строк – URL файлов, которые клиент прислал боту, а бот загрузил в хранилище файлов. Чтобы передавать его, в некоторых случаях нужно привести этот список к строке. Для этого можно воспользоваться jinja-фильтрами | list|join(', '), а также проверять ответ на пустоту.",
    "meta": {
      "page": 118,
      "section": "9 Возможности использования макросов в них описываются отдельно в описании каждого действия."
    }
  },
  {
    "text": "119 Например, чтобы передать ответ на вопрос типа «Файл» в параметре запроса вызова внешней системы или как аргумент события, которое генерируется в рассылке, нужно использовать конструкцию вида: slots.answer5|list|join(', ') if slots.answer5 else None где answer5 – это идентификатор вопроса типа «Файл». Например (см. Рисунок 156): Рисунок 156 — Использование ответа на вопрос типа «Файл» при генерации события При использовании jinja-шаблонов применение фильтров и проверка на пустоту для ответов на вопрос типа «Файл» не требуется. Можно просто писать: {{ form.answer5 }} Особенности и «трюки» при использовании форм • Форма может быть добавлена только в целевую рассылку. Информационные рассылки не поддерживают работу форм. • Одна целевая рассылка может содержать только одну форму. При необходимости проведения большого или растянутого опроса можно использовать цепочку рассылок, где каждая рассылка будет содержать свою форму и запускать следующую путем генерации события из своего сценария. Например, можно сделать так, чтобы следующая рассылка запускалась только если клиент успешно ответил на все вопросы формы в предыдущей рассылке (см. Рисунок 157). При необходимости, в следующую рассылку можно передавать уже собранные ответы клиента (с помощью аргументов событий, генерируемых для старта последующих рассылок).",
    "meta": {
      "page": 119,
      "section": "10 Кроме выхода клиента из формы при вводе трех неподходящих ответов."
    }
  },
  {
    "text": "120 Рисунок 157 — Сценарий рассылки с формой, где при успешном заполнении формы генерируется событие, запускающее рассылку со следующей формой • Во время работы формы оператор не должен открывать диалог с клиентом по своей инициативе (и не сможет, если у него нет соответствующих прав на канал Bot). • Во время работы формы другие целевые рассылки не будут приходить клиенту (как и в случае, когда клиент ведет диалог с оператором). • Возможен повторный запуск формы в рамках одной рассылки. Маркетолог может создать зацикленный сценарий, в котором, например, при выходе по таймауту клиенту приходит сообщение с предложением начать опрос заново. Сценарий такой рассылки приведен ниже (см. Рисунок 158). При повторном запуске формы все ответы, данные ранее, стираются. Рисунок 158 — Повторный вызов формы в рамках одной рассылки • Работа макросов в формах пока не поддерживается нигде, кроме текстов вопросов.",
    "meta": {
      "page": 120,
      "section": "10 Кроме выхода клиента из формы при вводе трех неподходящих ответов."
    }
  },
  {
    "text": "121 • Если все вопросы формы не обязательные, то при пропуске всех вопросов форма все равно считается успешно заполненной. Значение всех ответов при этом будет сохранено как «None». • Для переноса строки в текстах сообщений и вопросов форм не нужно явно использовать \\n, как в остальных блоках рассылки. Отписка от рассылок Маркетолог может предоставить клиентам возможность отписаться от рассылок. Для этого нужно выставить соответствующую опцию в любой кнопке-действии (см. Рисунок 159). Рисунок 159 — Настройка отписки от рассылок при нажатии на кнопку-действие Другим способом отписки от рассылок является отправка боту клиентом одного из текстовых сообщений: stop subscriptions stop subscription стоп рассылки стоп рассылка start subscriptions start subscription старт рассылки старт рассылка Если клиент отписался в одной из рассылок, то отписка действует на все рассылки. Уже запущенные рассылки работают в соответствии с настройками при отписке клиента (см. подробнее в разделе Расширенные настройки). После того, как клиент отписался, новые",
    "meta": {
      "page": 121,
      "section": "10 Кроме выхода клиента из формы при вводе трех неподходящих ответов."
    }
  },
  {
    "text": "122 рассылки для него не начинаются, если не установлен флажок «Отправлять сообщения даже если клиент отписался от рассылок» в расширенных настройках. Подписка на рассылки возможна двумя способами: 1. Отправка клиентом боту одного из сообщений: старт рассылки start subscriptions 2. Специальный API-вызов (см. запрос «Подписка клиента на рассылки» API консоли маркетолога). Важно отличать отписку от рассылок и отписку от бота. Отписка от рассылок реализуется специальным флагом для клиента на уровне консоли маркетолога и может быть проигнорирована ботом. Отписка от бота выполняется клиентом на уровне его мессенджера и не может быть проигнорирована ботом. В этом случае ни маркетинговые рассылки, ни сообщения от операторов из консоли операторов не будут получены клиентом, пока он не разрешит получать сообщения от бота по своей инициативе. Также нужно помнить, что некоторые мессенджеры, например, Facebook* и Instagram*, блокируют возможность отправки сообщений клиенту если тот не отправлял сообщения боту в течение последних 24 часов. Отправка рассылки клиенту Facebook* возможна, если в расширенных настройках рассылки задан специальный тег. Подробнее об этом написано в пункте «Теги сообщений» раздела «Расширенные настройки» . Настройка виджетов подключения к боту для сайта компании Виджеты предназначены для того, чтобы клиенты могли перейти к диалогу с ботом или оператором компании прямо со страницы сайта компании (см. Рисунок 160). Таким образом, в частности, решается задача накопления аудитории. Рисунок 160 — Расположение виджетов на странице сайта",
    "meta": {
      "page": 122,
      "section": "10 Кроме выхода клиента из формы при вводе трех неподходящих ответов."
    }
  },
  {
    "text": "123 Виджет позволяет перейти к диалогу с ботом, используя один из поддерживаемых мессенджеров на выбор. Для создания виджета необходимо: 1. Выбрать в верхнем правом углу окна бота, для которого будет создаваться виджет. 2. Перейти в раздел «Инструменты роста» и на вкладке «Виджеты» нажать на кнопку «+ Создать» в правом верхнем углу (см. Рисунок 161). Рисунок 161 — Переход к созданию виджета 3. Ввести название виджета и нажать на кнопку «Создать» (см. Рисунок 162). Рисунок 162 — Ввод названия виджета 4. В списке виджетов нажать на название только что созданного виджета для редактирования его настроек (см. Рисунок 163). Настройки виджета разделены на две вкладки «Desktop» и «Mobile» и позволяют, соответственно, задать отображение для десктопной и мобильной версии. Каждая версия настраивается независимо и имеет одинаковый набор настроек.",
    "meta": {
      "page": 123,
      "section": "10 Кроме выхода клиента из формы при вводе трех неподходящих ответов."
    }
  },
  {
    "text": "124 Рисунок 163 — Настройка виджета Важно! Тип отображения (Desktop или Mobile) определяется не типом устройства, на котором открыта страница с виджетом, а шириной окна браузера11. На узких экранах мобильных устройств будет отображаться мобильная версия. При этом ее можно также увидеть на широком экране, если сузить окно браузера с сайтом, на котором установлен виджет. И наоборот, на планшетах с достаточной шириной экрана будет выводиться десктопная версия. Поле «Deeplink» определяет, какой диплинк будет передаваться боту при переходе клиента к диалогу с ботом через этот виджет. Так, например, можно настроить виджет, который будет переводить клиентов в заданный канал. Для этого нужно выбрать deeplink, переводящий в этот канал (см. Рисунок 164).",
    "meta": {
      "page": 124,
      "section": "10 Кроме выхода клиента из формы при вводе трех неподходящих ответов."
    }
  },
  {
    "text": "125 Рисунок 164 — Выбор диплинка для передачи боту Список мессенджеров в нижней части настроек определяет, какие мессенджеры будут доступны клиентам (см. Рисунок 165). Если какой-то мессенджер недоступен для выбора, это означает, что интеграция для этого мессенджера в настройках бота не настроена. * Рисунок 165 — Список доступных мессенджеров в настройках виджета Для установки созданного виджета на страницу сайта нужно нажать на кнопку «Документация» в правом верхнем углу и поместить предоставленный там js-код (см. Рисунок 166) на эту страницу. Рисунок 166 — Код виджета для вставки на страницу сайта",
    "meta": {
      "page": 125,
      "section": "11 Значение ширины, различающее десктопное и мобильное отображения, составляет 640 пикселей; высоты"
    }
  },
  {
    "text": "126 После этого посетители страницы смогут пользоваться созданным виджетом. Важно! При изменении настроек виджета не следует менять js-код, добавленный на страницу сайта. При необходимости отключить виджет это можно сделать переключателем слева от названия виджета. Также отдельно могут быть отключены мобильная или десктопная версии виджета. При временном отключении виджета убирать js-код со страницы сайта также не обязательно (см. Рисунок 167). Рисунок 167 — Элементы интерфейса для включения и отключения виджета в целом и для отдельных типов отображения Настройка посадочных страниц для подключения клиентов к боту Посадочные страницы (лендинги) используются для подключения клиентов к боту через удобный для клиента мессенджер. При этом лендинг размещается на сайте Maxbot, для этого не нужно самостоятельно разворачивать новый сайт или создавать дополнительную страницу на существующем сайте. Ниже приведено описание процесса создания и настройки посадочной страницы, а далее в подразделе Механизм подключения клиентов — описание того, что увидит клиент в процессе подключения. Создание и настройка посадочной страницы Для создания лендинга необходимо: 1. Выбрать в верхнем правом углу окна бота, для которого будет создаваться лендинг. 2. Открыть раздел «Инструменты роста» и на вкладке «Лендинги» нажать на кнопку «+ Создать» в правом верхнем углу (см. Рисунок 168).",
    "meta": {
      "page": 126,
      "section": "11 Значение ширины, различающее десктопное и мобильное отображения, составляет 640 пикселей; высоты"
    }
  },
  {
    "text": "127 Рисунок 168 — Переход к созданию лендинга 3. Ввести имя лендинга (см. Рисунок 169) и нажать на кнопку «Создать». Рисунок 169 — Ввод имени лендинга 4. В списке лендингов нажать на имя только что созданного лендинга для редактирования его настроек (см. Рисунок 170). Слева задаются настройки лендинга, справа отображается макет лендинга в соответствии с заданными настройками. Ссылка на лендинг размещается справа от его названия. Для отключения лендинга предназначен переключатель слева от его названия. Список мессенджеров в нижней части настроек вкладки «Основные» определяет, какие мессенджеры будут доступны клиентам. Если какой-то мессенджер недоступен для выбора, это означает, что транспорт для этого мессенджера в настройках бота не настроен.",
    "meta": {
      "page": 127,
      "section": "11 Значение ширины, различающее десктопное и мобильное отображения, составляет 640 пикселей; высоты"
    }
  },
  {
    "text": "128 Рисунок 170 — Страница настройки лендинга Поле «Deeplink» на вкладке «Интеграция» определяет, какой диплинк будет передаваться боту при переходе клиента по ссылкам на странице лендинга. Так, например, можно настроить лендинг, который будет переводить клиентов в заданный канал. Для этого нужно выбрать Deeplink, переводящий в этот канал. Важно! Если лендинг будет использоваться в SMS-блоке рассылок, то при переходе из SMS диплинк, заданный в настройках лендинга, будет заменен на диплинк подтверждения номера телефона. Диплинк, заданный в настройках лендинга, не сработает. Это нужно учитывать при выборе лендинга для SMS-рассылок. Лендинги поддерживают интеграцию с различными метриками — Яндекс.Метрикой, Google Analytics, пикселями ВКонтакте и Facebook*. Они настраиваются в разделе «Интеграция». Для настройки метрики необходимо зарегистрироваться в выбранной системе и получить идентификатор или ключ для интеграции и ввести его в поле соответствующей метрики (см. Рисунок 171).",
    "meta": {
      "page": 128,
      "section": "11 Значение ширины, различающее десктопное и мобильное отображения, составляет 640 пикселей; высоты"
    }
  },
  {
    "text": "129 Рисунок 171 — Ввод настроек интеграции При работе с пикселем ВКонтакте необходимо учитывать, что в отличие от остальных метрик, в том числе Facebook*, учитываются только посещения клиентов, авторизованных в этой социальной сети. Механизм подключения клиентов Механизм подключения для клиента выглядит при этом следующим образом: 1. Клиент переходит по присланной ему ссылке (см. Рисунок 172). Рисунок 172 — SMS-рассылка со ссылкой на лендинг 2. Клиенту отображается лендинг, размещаемый на ресурсе Maxbot (т. е. для этого не нужно самостоятельно создавать отдельный сайт или страницу на сайте компании). На странице отображается список мессенджеров, с помощью которых можно подключиться (см. Рисунок 173).",
    "meta": {
      "page": 129,
      "section": "11 Значение ширины, различающее десктопное и мобильное отображения, составляет 640 пикселей; высоты"
    }
  },
  {
    "text": "130 Рисунок 173 — Лендинг с перечнем доступных мессенджеров, которые можно использовать для общения с ботом 3. Клиент выбирает удобный ему мессенджер. Примечание: Если какая-либо кнопка не срабатывает, значит соответствующее приложение мессенджера не установлено и его сначала необходимо установить. 4. Клиент запускает приложение соответствующего мессенджера (в нашем примере — Telegram, см. Рисунок 174). После старта бота происходит автоматическое подтверждение номера телефона. Рисунок 174 — Клиент подтвердил номер телефона и продолжил общение с ботом в Telegram Просмотр журнала рассылок В разделе «Журнал» маркетолог может узнать количество клиентов, для которых рассылка запускалась и с какими статусами произошли запуски. В Журнале рассылок отображаются все созданные и запущенные рассылки для выбранного бота (см. Рисунок 175)",
    "meta": {
      "page": 130,
      "section": "11 Значение ширины, различающее десктопное и мобильное отображения, составляет 640 пикселей; высоты"
    }
  },
  {
    "text": "131 Рисунок 175 — Отображение вкладки \"Журнал\" В этом разделе при помощи фильтра по названию можно найти данные по нужной рассылки. Данные представленные в формате таблицы: • Название рассылки – при клике переход на рассылку; • Статистика по рассылке – при клике переход на статистику; • Запуск – время последнего перехода рассылки в активный режим; • Состояние – текущее состояние рассылки. Следующие столбцы представлены в виде таблицы (см. Таблица 8) с описанием их значения. Таблица 8 — Описание столбцов в журнале рассылок Название столбца Описание Всего клиентов Всего клиентов, которым была запущена рассылка Успех Кол-во клиентов, которым рассылка дошла успешно Успех (sms) Кол-во клиентов, которым успешно отправлены sms Ошибка Кол-во клиентов, для которых рассылка не началась из- за ошибки при запуске Ошибка при отправке sms Кол-во клиентов, для которых провайдер, через которого отправлялись смс, вернул ошибку Нет SMS-блока Кол-во клиентов, которые пропущены, т.к. в рассылке нет sms-блока Клиенты других рассылок Кол-во клиентов, исключенных из рассылки, т.к. они входят в аудиторию других рассылок Отписались Кол-во клиентов, которые отписались от целевых рассылок.",
    "meta": {
      "page": 131,
      "section": "11 Значение ширины, различающее десктопное и мобильное отображения, составляет 640 пикселей; высоты"
    }
  },
  {
    "text": "132 Название столбца Описание Пропущено Кол-во клиентов, которым рассылка уже отправлялась. В рассылке не стоит флаг «Отправлять клиентам, которые уже получали эту рассылку» Ошибка при генерации deeplink (sms) Кол-во клиентов, у которых при отправке sms не удалось сгенерировать deeplink Ошибка при вызове внешней системы (sms) Кол-во клиентов, у которых вызов внешней системы перед отправкой sms завершился с ошибкой Не оплачены Кол-во клиентов, которые не получили рассылку из-за того, что клиентов больше, чем предусмотрено текущим тарифом. Рассылка не успела начаться Кол-во клиентов, для которых рассылка не успела начаться из-за ограничения времени начала рассылки, либо из-за того, что маркетолог вручную остановил рассылку. Выгрузка данных для выбранного бота Выгрузка аудитории В разделе «Выгрузка данных» маркетолог может выгрузить всех клиентов выбранного бота (см. Рисунок 176). Рисунок 176 — Выгрузка аудитории для выбранного бота Данные аудитории выгружаются в формате CSV. Формат файла:",
    "meta": {
      "page": 132,
      "section": "11 Значение ширины, различающее десктопное и мобильное отображения, составляет 640 пикселей; высоты"
    }
  },
  {
    "text": "133 customer_messenger_id;name;messenger_type;create_date;add_phone_date;phone;unsubscribed; allow_message;timezone;tags;first_customer_message_date;last_customer_message_date где: • customer_messenger_id — идентификатор клиента в Maxbot; • name — имя клиента в мессенджере; • messenger_type — тип мессенджера; • create_date — дата первого подключения к боту; • add_phone_date — дата подтверждения номера телефона; • phone — номер телефона; • unsubscribed — признак того, отписан ли клиент от рассылок (true или false); • allow_message — признак возможности отправки клиенту сообщений в мессенджере (если клиент отписался от бота, то будет значение false); • timezone — часовой пояс клиента (может быть не задан, если клиент не добавлялся в аудиторию рассылок); • tags — список тегов клиента, в квадратных скобках через запятую; • first_customer_message_date — дата первого сообщения от клиента; • last_customer_message_date — дата последнего сообщения клиента. Выгрузка статистики рассылок В разделе «Выгрузка данных» также можно скачать «сырую» (необработанную) статистику рассылок для выбранного бота и выбранной рассылки (см. Рисунок 177)12. Рисунок 177 — Выгрузка статистики рассылок для выбранного бота",
    "meta": {
      "page": 133,
      "section": "11 Значение ширины, различающее десктопное и мобильное отображения, составляет 640 пикселей; высоты"
    }
  },
  {
    "text": "134 Статистика выгружается в формате CSV и содержит информацию о блоках действий, выполненных для клиентов в рамках выбранных рассылок. Если не указано ни одной рассылки, то выгружается статистика по всем рассылкам, за заданный период. Например, клиенту отправлена рассылка, изображенная ниже (см. Рисунок 178). Если в рассылке клиент нажмет на кнопку «Подробнее», то в статистику добавится три записи: о выполнении блока «Основная информация», блока «Подробности» и блока «Напоминание» с датой и временем выполнения каждого блока, информацией о клиенте, рассылке и т. д. Если другой клиент после получения блока «Основная информация» отпишется от рассылок, то в статистику добавится только одна запись – о выполнении блока «Основная информация». Рисунок 178 — Пример рассылки с 3-мя блоками для сохранения статистики Скачиваемый CSV-файл со статистикой имеет поля, описание которых приведено в таблице ниже. Таблица 9 – Структура полей выгружаемого CSV-файла со статистикой Название поля Описание mailing_id Идентификатор рассылки mailing_type Тип рассылки (target - целевая, info - информационная) mailing_title Название рассылки customer_messenger_id Идентификатор клиента customer_create_date Дата и время первого подключения клиента к боту",
    "meta": {
      "page": 134,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "135 Название поля Описание customer_name Имя клиента (как было задано в мессенджере во время первого подключения к боту) customer_phone Подтвержденный клиентом номер телефона stats_create_datestats_time Дата и время выполнения действий блока (node_to) node_from_id Идентификатор блока–источника перехода node_from_name Название блока–источника перехода (или событие start) node_to_id Идентификатор блока, действия которого были выполнены node_to_name Название блока, действия которого были выполнены edge_type Тип связи между блоком-источником и блоком, действия которого были выполнены: timeout – задержка после отправки сообщения из блока-источника; button_click – нажатие кнопки в блоке-источнике; direct – связь от события start (при этом задержка может быть ненулевой). edge_button_id Идентификатор кнопки, которая нажата в блоке- источнике перехода edge_button_name Название кнопки, которая нажата в блоке-источнике перехода args Аргументы, указанные при генерации события, которое инициировало начало этой рассылки для данного клиента Отладка При работе с рассылками, которые начинаются при возникновении события, часто необходимо узнать, почему клиент или множество клиентов не получили рассылку. В консоли маркетолога есть специальный раздел «Отладка», который помогает разобраться, что произошло после возникновения определенного события (вкладка «События») или запуска рассылки (вкладка «Рассылки»).",
    "meta": {
      "page": 135,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "136 Рисунок 179 — Раздел «Отладка» Аудит вызовов событий На вкладке «События» можно найти информацию о попытках сгенерировать то или иное событие. Поиск возможен по дате события, а также по его характеристикам. (для этого нужно нажать на иконку фильтра, см. Рисунок 180): Рисунок 180 — Поиск события по его характеристикам Перечень доступных фильтров и их описание приведены в таблице 10. Между собой фильтры применяются по условию «И», т. е. возвращаются результаты, удовлетворяющие всем фильтрам.",
    "meta": {
      "page": 136,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "137 Таблица 10 — Описание фильтров для поиска событий Фильтр Описание Дата Дата попытки сгенерировать событие. Единственный обязательный фильтр для выполнения поиска. Название события В этом фильтре может быть указано полное название события или его часть (выполняется поиск заданной подстроки в названии события). Список идентификаторов рассылок Идентификаторы рассылок, которые начаты в результате вызова события. Фильтр применяется по условию «ИЛИ», т. е. возвращаются результаты, удовлетворяющие хотя бы одному из заданных значений. Список launch_result_ids Идентификаторы запусков (launch_customer_ids или sms_launch_customer_ids или delayed_trigger_event_id, или unsubscribed_trigger_event_id), полученные в результате генерирования событий. Фильтр применяется по условию «ИЛИ», т. е. возвращаются результаты, удовлетворяющие хотя бы одному из заданных значений. Идентификатор бота В этом фильтре может быть указано полное системное название бота или его часть, т. е. выполняется поиск заданной подстроки. Идентификатор клиента Идентификатор клиента, для которого началась рассылка в результате возникновения события. Имя клиента Имя клиента, для которого началась рассылка в результате возникновения события. Номер телефона Полный номер телефона клиента или его часть, для которого началась рассылка в результате возникновения события. Т.е. выполняется поиск заданной подстроки Типы запуска рассылки по событию Позволяет отфильтровать события по «последствиям» запуска. Можно задать одно или несколько значений из: • «Ожидание подтверждения телефона» – события, в результате вызова которых началось ожидание подтверждения клиентом номера телефона (случай, когда в результате вызова события возвращается delayed_trigger_event_id). • «Ожидание подписки на бота в мессенджере» – события, в результате вызова которых началось ожидание подписки клиента на бота в мессенджере (случай, когда в результате вызова события возвращается unsubscribed_trigger_event_id). • «Передано в транспорт мессенджера» – события, в результате вызова которых началось отправка рассылки в мессенджер (случай, когда в результате вызова события возвращается launch_customer_ids).",
    "meta": {
      "page": 137,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "138 Фильтр Описание • «Передано в SMS-провайдер» – события, в результате вызова которых началось отправка SMS-рассылки (через SMS-провайдер, случай, когда в результате вызова события возвращается sms_launch_customer_ids). Результат вызова события Статус-код запроса вызова события: • 200 — запрос выполнен успешно; • 40X – различные виды ошибок. Список возможных источников события Один или несколько источников, откуда сгенерировано событие: • Рассылка – события, сгенерированные из сценария рассылки (действие «Сгенерировать событие» в конструкторе рассылок); • Интерфейс – события, сгенерированные из консоли маркетолога; • API – события, сгенерированные путем вызова одного из запросов API; • Системное событие – системные события, сгенерированные ботом (в текущей версии Maxbot это «Подтверждение номера телефона» и «Добавление нового клиента»). Состояние запусков рассылки для клиента Статус запуска рассылки для клиента: • «Готов к отправке» — рассылка готова к началу, но еще не началась; • «Рассылка началась успешно»; • «Ошибка при запуске рассылки»; • «Пропущен, в рассылке нет SMS-блока» — сгенерировано событие для отправки SMS, но в рассылке нет SMS-блока; • «Пропущен, входит в аудиторию другой рассылки»; • «Клиент отписался от рассылок»; • «Клиент не оплачен»; • «Клиент уже получал рассылку»; • «Рассылка не успела начаться» – рассылка не началась, т. к. ее остановили, не успев начать ее для клиента; • «Ошибка при запуске SMS-рассылки»;",
    "meta": {
      "page": 138,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "139 Фильтр Описание • «Ошибка при вызове внешней системы в SMS-блоке»; • «Ошибка при генерации диплинка для SMS-блока» — при отправке SMS-рассылки с лендингом при генерации диплинка возникла ошибка; • «Телефон подтвержден до попытки отправить SMS» — клиент подтвердил номер телефона до отправки SMS, отправка будет осуществлена через мессенджер; • «Ожидает подписки клиента в мессенджере» — начало рассылки отложено до подписки клиентом на бота в мессенджере; • «Ожидает подтверждения номера телефона» — начало рассылки отложено до подтверждения клиентом номера телефона. В результате применения фильтров отображаются записи о попытках сгенерировать события, удовлетворяющие всем заданным условиям. Есть два режима отображения результатов: • режим карточек (см. Рисунок 181); • режим списка (см. Рисунок 182). Рисунок 181 — Просмотр найденных событий (режим карточек)",
    "meta": {
      "page": 139,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "140 Рисунок 182 — Просмотр найденных событий (режим списка) Режимы отличаются только визуально, переключение между ними выполняется при помощи иконки справа от фильтра. При нажатии на ссылку в поле «ID» можно перейти на страницу с детальной информацией о сгенерированном событии. Эта страница разделяется на две части. В верхней части страницы отображается общая информация о сгенерированном событии (см. Рисунок 183): • ID — идентификатор записи о генерации события в журнале аудита событий; • Источник — источник, откуда пришел запрос на генерацию события. См. «Список возможных источников события» выше; • Рассылка — название рассылки, если событие было сгенерировано из сценария рассылки; • Дата — дата генерации события; • Название события из запроса — название события, как оно было указано в запросе; • ID события — идентификатор события в системе; • ID клиента — идентификатор клиента, для которого было сгенерировано событие; • Мессенджер — мессенджер клиента, для которого было сгенерировано событие; • Телефон — телефон клиента, для которого было сгенерировано событие; • Тип — тип запроса на генерацию события. Возможные варианты: • По идентификатору клиента; • По номеру телефона; • Для рассылок с фиксированной аудиторией;",
    "meta": {
      "page": 140,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "141 • Запрос — тело запроса на генерацию события. Для просмотра и копирования нужно навести мышью на «глазок»; • Статус-код — HTTP status code ответа на запрос генерации события; • Ответ — тело ответа на запрос генерации события. Для просмотра и копирования нужно навести мышью на «глазок». Рисунок 183 — Общая информация о сгенерированном событии В нижней части страницы отображается информация о рассылках, начавшихся в результате возникновения события, либо информация о начавшемся ожидании подтверждения номера телефона или подписки клиента в мессенджере. Информация на странице с деталями события позволяет понять, началась ли рассылка при вызове события, а также ответить на вопросы – если рассылка началась, то какая, и если не началась, то почему. Далее в подразделах приведены примеры вывода такой информации. Рассылка в мессенджер (одна или несколько) началась сразу после возникновения события Сведения о начавшихся рассылках в мессенджере содержат (см. Рисунок 184): • ID — идентификатор записи о генерации события в журнале аудита событий; • Дата — дата генерации события; • MID — идентификатор начавшейся рассылки. При нажатии на ссылку можно перейти на страницу с информацией о ходе выполнения рассылки для этого клиента. Подробнее это описано в разделе Просмотр хода выполнения рассылок; • Рассылка — название рассылки, которая началась в результате вызова события. При клике по ссылке можно перейти на страницу редактирования рассылки; • Launch — идентификатор запуска рассылки, получаемый при генерации события (в поле launch_customer_ids ответа на запрос генерации события);",
    "meta": {
      "page": 141,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "142 • Запуск, Остановка — даты запуска и остановки рассылки соответственно (в текущей версии Maxbot) не заполняется; • Состояние — текущее состояние рассылки; • CID — идентификатор клиента, для которого началась рассылка; • Статус — состояние запуска рассылки для клиента, см. ранее описание фильтра «Состояние запусков рассылки для клиента»; • Попыток — количество попыток начать рассылку; • Последняя попытка — дата последней попытки начать рассылку для клиента. • Аргументы — аргументы события, переданные при генерации. Для просмотра и копирования нужно навести мышью на «глазок». Рисунок 184 — Пример вывода информации о рассылках в мессенджер, которые начались сразу после возникновения события SMS-рассылка (одна или несколько) началась сразу после возникновения события Сведения о начавшихся SMS-рассылках практически аналогичны варианту с рассылкой в мессенджер. Дополнительно для SMS-рассылок отображаются следующие данные (см. Рисунок 185): • Телефон — телефон, для которого сгенерировано событие; • Мессенджеры — список messenger_order, как он был указан при вызове события; • Временная зона — значение поля timezone, указанное при вызове события.",
    "meta": {
      "page": 142,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "143 Рисунок 185 — Пример вывода информации о SMS-рассылке, которая началась сразу после возникновения события Если сообщения не приходят, то разобраться в причине можно, изучив ответ от SMS- провайдера. Для этого необходимо нажать на иконку в поле «Ошибка» (если ошибка имеет место), см. рисунок 186: Рисунок 186 — Просмотр информации об ошибке при отправке SMS-рассылок Вызов события отложен до подтверждения номера телефона Сведения о событиях, отложенных до подтверждения номера телефона, практически аналогичны вариантам, описанным ранее. Дополнительно отображаются следующие данные (см. Рисунок 187):",
    "meta": {
      "page": 143,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "144 • TTL — таймаут ожидания подтверждения номера телефона, заданный при вызове события; • Истечение — дата, когда истекло ожидание. Рисунок 187 — Пример вывода информации о событии, отложенном до подтверждения номера телефона Вызов события отложен до подписки на бота в мессенджере Сведения о событиях, отложенных до подписки на бота в мессенджера, практически аналогичны вариантам, описанным ранее. Дополнительно отображаются следующие данные (см. Рисунок 188): • TTL — таймаут ожидания подписки на бота в мессенджере, заданный при вызове события; • Истечение — дата, когда истекло ожидание подписки. Рисунок 188 — Пример вывода информации о событии, отложенном до подписки на бота в мессенджере",
    "meta": {
      "page": 144,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "145 Аудит запусков рассылок В некоторых случаях исследование проблем удобнее проводить от рассылки, а не от события. Кроме того, не все рассылки начинаются по событию, некоторые начинаются при выставлении тега или в заданное время. В этом случае удобно использовать вкладку «Рассылки». На данной вкладке можно выполнить поиск информации о запусках рассылок по дате, а также по их характеристикам (для этого нужно нажать на иконку фильтра, см. Рисунок 189). Рисунок 189 — Поиск рассылок по их характеристикам Перечень доступных фильтров и их описание приведены в таблице 11. Для поиска необходимо задать хотя бы один из обязательных фильтров – «Идентификатор», «Название рассылки» или «Дата начала рассылки для клиента». Таблица 11 — Описание фильтров для поиска рассылок Фильтр Описание Идентификатор Идентификатор рассылки. Состояние рассылки Текущее состояние рассылки. Имя клиента Часть или полное имя клиента, для которого началась рассылка. Мессенджер Мессенджер, через который началась рассылка. Номер телефона Номер телефона клиента, для которого началась рассылка. Состояние запусков рассылки для клиента См. аналогичное поле ранее в таблице 10.",
    "meta": {
      "page": 145,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "146 В результате применения фильтров отображаются записи о запусках рассылок, удовлетворяющие всем заданным условиям. Есть два режима отображения результатов: • режим карточек (см. Рисунок 190); • режим списка (см. Рисунок 191). Режимы отличаются только визуально, переключение между ними выполняется при помощи иконки справа от фильтра. Рисунок 190 — Вывод информации о найденных рассылках (режим карточек) Рисунок 191 — Вывод информации о найденных рассылках (режим списка) Информационные поля аналогичны тем, что описаны в подразделе Аудит вызовов событий. При нажатии на ссылку в поле «MID» выполняется переход на страницу с информацией о ходе выполнения рассылки для клиента. При нажатии на ссылку в поле «Состояние» выполняется переход на страницу со статистикой по рассылке (см. подробнее в подразделе Работа со статистикой). Просмотр хода выполнения рассылок В некоторых случаях нужно знать не только когда рассылка началась и для каких клиентов, но и знать, как она выполнялась для конкретного пользователя — что делал клиент (какие нажимал кнопки, что писал) и что ему отвечал бот в рамках рассылок.",
    "meta": {
      "page": 146,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "147 Для этого предназначена специальная страница — «Ход исполнения рассылок». Попасть на нее можно из раздела «Отладка» по ссылкам из полей «MID» в результатах поиска. Информация на данной странице делится на два блока. Верхний блок — общая информация о рассылке, клиенте и запусках этой рассылки для этого клиента (см. Рисунок 192). Помимо сведений о рассылке и о клиенте здесь отображаются два признака: • «Разрешена отправка сообщений» — признак свидетельствует о текущем состоянии подписки клиента на бота в мессенджере. Если флажок установлен, то клиент подписан, если снята — отписан. Не следует путать это с подпиской/отпиской на рассылки. • «Пользователь добавлен в таблицу ″Оплаченных пользователей″» - признак свидетельствует о том, оплачено ли обслуживание этого клиента или нет в соответствии с текущим тарифом. Рисунок 192 — Общая информация о рассылке Если SMS не приходят, то разобраться можно, изучив ответ от SMS-провайдера. Для этого необходимо нажать на иконку в поле «Ошибка» (если ошибка имеет место), см. рисунок 193:",
    "meta": {
      "page": 147,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "148 Рисунок 193 — Информация об ошибке при запуске SMS-рассылки Нижний блок содержит описание хода выполнения всех запусков рассылки для этого клиента (см. Рисунок 194). Слева выводятся возникающие события — начало рассылки, реакция клиента (например, нажатие на кнопку), события от планировщика для отправки сообщений с заданным таймаутом и т. д. Справа выводится действия бота — реакция на возникающие события. Здесь же выводятся некоторые пояснения по ходу выполнения рассылки. Например, «От события \"старт\" ждем 120 секунд и закрытия треда, а затем переходим в блок \"Блок\"» или «Обработка нажатий на кнопки выключена». Нажатие на ссылки «response» или «event» позволяет раскрыть детали события или действия. Рисунок 194 — Ход выполнения рассылки для клиента Информация в этом блоке позволяет восстановить ход выполнения рассылки для конкретного клиента и понять причины той или иной реакции бота. В случае SMS-рассылок страница выглядит несколько иначе (см. Рисунок 195). На ней отображается только общая информация о рассылке, клиенте и ее запусках для этого",
    "meta": {
      "page": 148,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "149 клиента. Нижней части с информацией о ходе выполнения рассылки нет, т. к. SMS- рассылки не подразумевают реакцию клиента. Рисунок 195 — Ход выполнения SMS-рассылки Работа со статистикой Статистика делится на три раздела: • Статистика по всем рассылкам за заданный период; • Статистика по всем рассылкам за сутки; • Статистика по определенной рассылке за заданный период. Ниже каждый из них описан подробно. Почти все графики позволяют получить детальную информацию путем нажатия на выбранный счетчик. Статистика по всем рассылкам за заданный период Перейти в раздел можно из основного меню Marketer (см. Рисунок 196). В этом разделе доступно два фильтра – по датам и количество наиболее популярных результатов, которое будет выводиться на графиках с префиксом «TOP» (описаны ниже). Второй фильтр позволяет задать, сколько наиболее популярных результатов будет выводиться на TOP-графиках.",
    "meta": {
      "page": 149,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "150 Рисунок 196 — Переход в раздел «Статистика» Например, если на графике выводится количество отправленных сообщений с разбиением по рассылкам и в фильтре выбрано «3», то на графике за каждый день будет выводиться не больше трех13 рассылок, которые отправили наибольшее количество сообщений. Также при наведении на любой график отображается иконка , при нажатии на которую можно скачать соответствующие результаты в текстовом формате (CSV, XLSX или JSON, см. Рисунок 197). Рисунок 197 — Переход к скачиванию результатов для выбранного графика Ниже приведено описание каждого из графиков. Messages sent for the period. Grouped by mailing type – быстрая оценка динамики отправляемых в мессенджеры сообщений раздельно для информационной и целевых рассылок. Данные суммируются для возможности оценить общее количество отправленных сообщений по дням. TOP: Messages sent for the period. Grouped by mailing name – оценка наиболее популярных (TOP'а) рассылок, отправляющих максимальное число сообщений за сутки. Позволяет оценить динамику за выбранный период.",
    "meta": {
      "page": 150,
      "section": "12 В панели маркетолога также есть раздел «Статистика», в котором можно посмотреть другие,"
    }
  },
  {
    "text": "рассылка отправила 100 сообщений, вторая 80, а третья и четвертая по 50, то будут выведены все 4 рассылки, т.к. у двух из них одинаковое количество отправленных сообщений, и выбрать между ними одну нельзя.",
    "meta": {
      "page": 150,
      "section": "13 Результатов может быть больше, чем задано в фильтре. Например, если в фильтре задано «3» и одна"
    }
  },
  {
    "text": "151 Рисунок 198 — Просмотр графиков Messages sent for the period. Grouped by messenger type – отражает количество сообщений, отправленный в каждый из мессенджеров. Дает возможность сравнить динамику по дням. Название мессенджера выводится при наведении указателя мыши на график. Audience growth. Grouped by messenger type – оценка прироста аудитории за выбранный период. Дает возможность понять, какой мессенджер растет быстрее. Перехода к другим графикам и детализации информации нет. Audience. Grouped by messenger type – динамика изменения аудитории показывает общее количество клиентов каждого из мессенджеров. Позволяет оценить динамику изменения за выбранный период. Группировка по мессенджерам. Перехода к другим графикам и детализации информации нет. Рисунок 199 — Просмотр графиков SMS sent for the period. Grouped by send_status – график отражает динамику отправки SMS за период с учетом статуса (успеха) отправки. TOP: SMS sent for the period. Grouped by mailing name – график показывает рассылки, отправляющие наибольшее количество SMS за сутки. Дает возможность сравнить эту динамику за период.",
    "meta": {
      "page": 151,
      "section": "13 Результатов может быть больше, чем задано в фильтре. Например, если в фильтре задано «3» и одна"
    }
  },
  {
    "text": "152 Рисунок 200 — Просмотр графиков Events generated for the period. Grouped by status_code – график показывает количество генерируемых событий за период. Группировка по статус-коду (200, 409, 404 и т.д.). TOP: Events generated for the period. Grouped by event name – график показывает события, сгенерированные наибольшее число раз за сутки. Есть возможность сравнить эту динамику за период. Рисунок 201 — Просмотр графиков Events for the period have timed out. Grouped for a reason – показывает количество отложенных событий, у которых истекло TTL (время ожидания) за период. TOP: Events for the period have timed out. Grouped for event name – показывает TOP событий, истекших наибольшее количество раз за каждые сутки. Данные сгруппированы по имени события.",
    "meta": {
      "page": 152,
      "section": "13 Результатов может быть больше, чем задано в фильтре. Например, если в фильтре задано «3» и одна"
    }
  },
  {
    "text": "153 Рисунок 202 — Просмотр графиков Successful mailing launches. Grouped by mailing type – график показывает количество успешных стартов (начальный событий) рассылок. Сгруппированы по типу рассылки. TOP: Delayed events. Grouped for a reason – график показывает TOP отложенных и актуальных (не просроченных) на текущий момент событий. События сгруппированы по критерию ожидания («ожидает подтверждение номера телефона» или «ожидает подписки на бота в мессенджере»). Рисунок 203 — Просмотр графиков TOP: Successful info mailing launches. Grouped by mailing name – график показывает TOP событий, стартующих информационные рассылки. События сгруппированы по имени рассылки. TOP: Successful target mailing launches. Grouped by mailing name – график показывает TOP событий, стартующих целевые рассылки. События сгруппированы по имени рассылки.",
    "meta": {
      "page": 153,
      "section": "13 Результатов может быть больше, чем задано в фильтре. Например, если в фильтре задано «3» и одна"
    }
  },
  {
    "text": "154 Рисунок 204 — Просмотр графиков Successful change of state in target mailings – график показывает количество успешных переходов между блоками в целевых рассылках. TOP: Successful change of state in target mailings. Grouped by mailing name – график показывает рассылки с наибольшим количеством переходов между блоков. Группировка по имени рассылки. Рисунок 205 — Просмотр графиков Статистика за сутки Перейти в этот раздел можно по нажатию на некоторые графики статистики за заданный период, например, «Messages sent for the period. Grouped by mailing type». Ниже приведено описание каждого из графиков данной группы.",
    "meta": {
      "page": 154,
      "section": "13 Результатов может быть больше, чем задано в фильтре. Например, если в фильтре задано «3» и одна"
    }
  },
  {
    "text": "155 Рисунок 206 — Просмотр графиков SMS sent per day - количество успешно отправленных SMS с разбивкой по рассылкам. Messages sent by info mailings per day. Grouped by name - количество успешно отправленных сообщений информационными рассылками с разбивкой по рассылкам. Messages sent by targeted mailings per day. Grouped by name - количество успешно отправленных сообщений целевыми рассылками с разбивкой по рассылкам. * Рисунок 207 — Просмотр графиков Messages sent by per day. Grouped by messenger - количество успешно отправленных рассылками сообщений по мессенджерам и по типу рассылки. SMS excluded per day. Grouped by name – количество неуспешно отправленных SMS из- за ошибки при валидации макросов с разбивкой по рассылкам.",
    "meta": {
      "page": 155,
      "section": "13 Результатов может быть больше, чем задано в фильтре. Например, если в фильтре задано «3» и одна"
    }
  },
  {
    "text": "156 Рисунок 208 — Просмотр графиков SMS send_failed per day. Grouped by name - количество неуспешно отправленных SMS из-за ошибки от SMS-провайдера с разбивкой по рассылкам. SMS rest_failed per day. Grouped by name - количество неуспешно отправленных SMS из- за ошибки при вызове внешней системы в SMS-блоке с разбивкой по рассылкам. Статистика по определенной рассылке за заданный период Доступ к статистике определенной рассылки можно получить из журнала рассылок (раздел «Журнал») – справа от названия рассылки необходимо нажать на иконку (см. Рисунок 209). Рисунок 209 — Переход к статистике по рассылке при помощи журнала Также перейти в этот раздел можно по нажатию на некоторые графики, например, «TOP: Messages sent for the period. Grouped by mailing name» в статистике за заданный период. Аналогично статистику по рассылке можно посмотреть из списка рассылок, нажав на иконку и выбрав пункт «Посмотреть статистику» см. Рисунок 210.",
    "meta": {
      "page": 156,
      "section": "13 Результатов может быть больше, чем задано в фильтре. Например, если в фильтре задано «3» и одна"
    }
  },
  {
    "text": "157 Рисунок 210 — Просмотр статистики из списка рассылок Также статистику по рассылке можно посмотреть из редактора рассылок, нажав на иконку . После нажатия статистика открывается в новом окне (см. Рисунок 211). Рисунок 211 — Кнопка для перехода на статистику по рассылке В этом разделе помимо фильтра по дате добавлена возможность отбросить из некоторых графиков наиболее популярные, превалирующие результаты, чтобы масштаб графика позволил изучить менее популярные результаты. Для этого нужно выбрать какое количество наиболее популярных результатов будет исключено. По умолчанию 0 (прочерк в фильтре), т.е. никакие результаты не исключаются. Рисунок 212 — Просмотр графиков Ниже приведено описание каждого из графиков данной группы.",
    "meta": {
      "page": 157,
      "section": "13 Результатов может быть больше, чем задано в фильтре. Например, если в фильтре задано «3» и одна"
    }
  },
  {
    "text": "158 Рисунок 213 — Просмотр графиков Messages sent by mailing for the period – показывает динамику отправки сообщений в разные мессенджеры за период. Рисунок 214 — Просмотр графиков Launches by mailing for the period – показывает динамику стартов рассылки для клиентов. Иными словами, показывает сколько новых запусков рассылки началось в каждый день выбранного интервала.",
    "meta": {
      "page": 158,
      "section": "13 Результатов может быть больше, чем задано в фильтре. Например, если в фильтре задано «3» и одна"
    }
  },
  {
    "text": "159 Рисунок 215 — Просмотр графиков Successful change of state in mailing for the period – показывает динамику переходов клиентов между блоками рассылок. API консоли маркетолога Порядок выполнения запросов к API консоли маркетолога, а также особенности обработки возможных ошибок описаны здесь. Перечень возможных запросов к API и их назначение перечислены в таблице 12. По ссылкам в столбце «Назначение» можно посмотреть примеры API-запросов и соответствующие им ответы. Дополнительные примеры использования API консоли маркетолога можно посмотреть здесь. Таблица 12 — Запросы к API консоли маркетолога № Запрос Назначение Генерация событий 1.  POST /v1/event Генерация события по идентификатору клиента 2.  POST /v1/event_by_phone Генерация события по номеру телефона 3.  POST /v1/event/on_create_launch/ <string:maxbot_name> Генерация события для рассылок с фиксированной аудиторией Проверка статуса событий 1.  GET /v1/state/customer/launch/ <int:launch_customer_id> Получение статуса запуска рассылки 2.  GET /v1/state/customer/delayed/launch/ <int:delayed_launch_customer_id> Получение статуса события, отложенного до подтверждения номера телефона",
    "meta": {
      "page": 159,
      "section": "13 Результатов может быть больше, чем задано в фильтре. Например, если в фильтре задано «3» и одна"
    }
  },
  {
    "text": "/v1/state/customer/unsubscribed/launch/ <int:unsubscribed_launch_customer_id> Получение статуса события, отложенного до подписки клиента в мессенджере Клиенты 1.  GET /v1/customers/export/bot /<string:maxbot_name> Получение списка всех клиентов 2.  GET /v1/customers/tags/bot/ <string:maxbot_name> Получение тегов клиентов 3.  POST /v1/customers/tags/bot/ <string:maxbot_name> Изменение тегов клиентов 4.  GET /v1/customers/subscribe/ <int:customer_messenger_id> Подписка клиента на рассылки Статистика 1.  POST /v1/mailing/stat/flow/export/bot/ <string:maxbot_name> Статистика выполнения рассылок (без агрегации) Запрос получения настроек рассылки GET /v1/mailing/<int:mailing_id>/settings Запрос позволяет получить все настройки рассылки в формате JSON. Параметры запроса Название Тип Описание mailing_id int Идентификатор рассылки, настройки которой необходимо получить. Авторизация возможна как по cookie, так и по Bearer-токену, см. «Ключ доступа к API консоли маркетолога» в настройках консоли маркетолога в Studio. Параметры ответа Название Тип Описание main object Словарь, описывающий основные настройки рассылки. launch_settings object Словарь, описывающий условия начала рассылки для клиентов. macros object Список макросов, использованных в рассылке. Задается только для рассылок со статической аудиторией. event_arguments object Список аргументов события, начинающего рассылку для клиента. Опциональный параметр,",
    "meta": {
      "page": 160,
      "section": "3.  GET"
    }
  },
  {
    "text": "161 задан только если рассылка начинается по событию. Ниже каждый из этих параметров описан подробно. Поля объекта main Название Тип Описание id int Идентификатор рассылки. maxbot_name string Название максбота. type enum of string: • info • target Тип рассылки: • информационная • целевая. title string Название рассылки. state enum of string: • init • active • passive • disabled Состояние рассылки: • Не запущена • Включена, активный режим • Включена, пассивный режим • Отключена audience_formation enum of string: • on_create • realtime • on_create_launch • on_create_planned • keyword • on_create_planned _by_url Тип аудитории рассылки. on_create – статическая аудитория (\"Начать сразу после запуска рассылки\" или \"Начать в заданное время\", если задан параметр when_start). realtime – динамическая аудитория (\"Начинать при возникновении события\" или \"Начинать при выставлении тега\", в зависимости от значения параметра trigger_by). on_create_launch – статическая аудитория, начало по событию («Начинать при возникновении события для заданной аудитории.»). on_create_planned – статическая аудитория, равномерная рассылка (\"Начать в заданное время и отправлять равномерно\"). keyword – динамическая аудитория, начала по ключевым словам (\"Начинать при получении ключевых слов\").",
    "meta": {
      "page": 161,
      "section": "3.  GET"
    }
  },
  {
    "text": "162 on_create_planned_by_url – динамическая аудитория, равномерная рассылка (\"Начать в заданное время и отправлять равномерно (аудитория из внешней системы)\"). when_start string Дата и время, когда рассылка начнется согласно настройкам. Надо отличать это время от времени запуска рассылки, т.е. когда маркетолог вручную переводит рассылку во включенное состояние (state = active).  Маркетолог может запустить рассылку в понедельник и задать в ее настройках начать рассылку во вторник, то есть отложенное начало рассылки. В этом случае в параметре when_start будет задан вторник. when_stop string Дата и время, когда прекратятся попытки начать рассылку для клиентов согласно настройкам. Надо отличать это время от времени остановки рассылки маркетологом вручную (state = disabled или passive). Этот параметр ограничивает время, когда рассылка может начинаться для клиентов, даже если она остается в активном состоянии. См. раздел «Время, после которого рассылка не начнется для клиентов». mailing_catalog_id int Идентификатор каталога, в котором находится рассылка. sms_provider_id int Идентификатор SMS-провайдера, который используется для отправки SMS в рамках этой рассылки. unsubscribable boolean Флаг, определяющий будет ли рассылка отправляться клиентам, которые отписались от рассылок. skip_launched_custo mers boolean Флаг, определяющий может ли рассылка повторно отправляться клиенту, который ее уже получал.",
    "meta": {
      "page": 162,
      "section": "3.  GET"
    }
  },
  {
    "text": "163 trigger_by enum of string: • tag • event Определяет условия начала рассылки для рассылок с audience_formation = realtime. По тегу или по событию. trigger_event_id int Идентификатор события, при возникновении которого рассылка начнется для клиента (только для рассылок по событию). exclude_weekdays enum of int: [0, … 6] Дни недели, в которые рассылка не будет отправляться клиенту. 0 – понедельник, 1 – вторник и т.д.. exclude_hours enum of int: [0, …, 23] Часы, в которые рассылка не будет отправляться клиенту. audience_count int Количество клиентов в аудитории рассылки. draft boolean Флаг, определяющий есть ли в конструкторе рассылки изменения, которые не добавлены в сценарий этой рассылки в боте. Иными словами, есть ли разница между тем что задано в конструкторе рассылки и тем, что в действительности делает бот. facebook_tag enum of string:",
    "meta": {
      "page": 163,
      "section": "3.  GET"
    }
  },
  {
    "text": "Теги, добавляемые к сообщениям для клиентов Facebook*. Подробнее см. в разделе «Расширенные настройки». send_date string Дата и время первого запуска рассылки. tags object Список тегов, приводящих к началу рассылки для клиента (action = start_on_add) или остановке рассылки для клиента (action = stop_on_add или action = stop_on_remove).",
    "meta": {
      "page": 163,
      "section": "• ACCOUNT_UPDATE"
    }
  },
  {
    "text": "164 Поля объекта launch_settings Название Тип Описание on_create object Словарь, описывающий условия начала рассылки, если задано «Начать сразу после запуска рассылки». on_create_at_time object Словарь, описывающий условия начала рассылки, если задано «Начать в заданное время». on_create_planned object Словарь, описывающий условия начала рассылки, если задано «Начать в заданное время и отправлять равномерно». on_create_planned_ by_url object Словарь, описывающий условия начала рассылки, если задано «Начать в заданное время и отправлять равномерно (аудитория из внешней системы)». keyword object Словарь, описывающий условия начала рассылки, если задано «Начинать при получении ключевых слов». realtime_tag object Словарь, описывающий условия начала рассылки, если задано «Начинать при выставлении тега». realtime_event object Словарь, описывающий условия начала рассылки, если задано «Начинать при возникновении события». on_create_launch object Словарь, описывающий условия начала рассылки, если задано «Начинать при возникновении события для заданной аудитории». Поля объекта macros Название Тип Описание [].id int Идентификатор макроса. [].name string Название макроса. [].type enum of string: • string • decimal • boolean • date • categorical Тип макроса. [].mailing_id int Идентификатор рассылки, в которой использован макрос. [].count int Количество вхождений макроса в тексты и настройки рассылки. Иными словами, сколько раз макрос использован в рассылке.",
    "meta": {
      "page": 164,
      "section": "• ACCOUNT_UPDATE"
    }
  },
  {
    "text": "165 Поля объекта event_arguments Название Тип Описание [].id int Идентификатор аргумента события. [].name string Название аргумента события (совпадает с названием макроса, использованного в рассылке, непосредственно используется в рассылке). [].title string Понятное человеку название аргумента события. [].type enum of string: • string • decimal • boolean • date • categorical Тип макроса. Пример выполнения запроса. curl -X GET -H \"Authorization: Bearer Contoso:eyJoщfDsaJkKrsGFH...\" \"https://mailing-factory.midvix.ai/v1/mailing/12345/settings\" Пример ответа: { \"event_arguments\": [ { \"id\": 735, \"name\": \"arg_1\", \"title\": \"Аргумент 1\", \"type\": \"string\" }, { \"id\": 736, \"name\": \"arg_2\", \"title\": \"Аргумент 2\", \"type\": \"decimal\" } ], \"launch_settings\": { \"realtime_event\": { \"exclude_hours\": [ 0, 1, 2, 3, 4, 5,",
    "meta": {
      "page": 165,
      "section": "• ACCOUNT_UPDATE"
    }
  },
  {
    "text": "166 6, 7, 8, 22, 23 ], \"exclude_weekdays\": [ 5, 6 ], \"trigger_event_id\": 497, \"trigger_event_name\": \"event_abc\" } }, \"main\": { \"audience_formation\": \"realtime\", \"draft\": true, \"exclude_hours\": [ 0, 1, 2, 3, 4, 5, 6, 7, 8, 22, 23 ], \"exclude_weekdays\": [ 5, 6 ], \"id\": 3616, \"mailing_catalog_id\": 51, \"maxbot_name\": \"maxbot_contoso\", \"skip_launched_customers\": true, \"sms_provider_id\": 33, \"state\": \"init\", \"title\": \"Mailing name\", \"trigger_by\": \"event\", \"trigger_event_id\": 497, \"type\": \"target\", \"unsubscribable\": true } }",
    "meta": {
      "page": 166,
      "section": "• ACCOUNT_UPDATE"
    }
  },
  {
    "text": "167 Термины и определения Аудитория рассылки – множество клиентов, для которых бот выполняет сценарий рассылки. В некоторых случаях клиенты могут не получить рассылку, например, если они отписались от рассылок или от бота в своем мессенджере. Диалог – Совокупность сообщений между компанией (ее операторами и ботами) и клиентом, относящаяся к решению проблемы по его обращению. Диплинк – Специальным образом сформированная ссылка, позволяющая передавать от клиента боту произвольный набор параметров. Запуск рассылки (launch) – Сущность в консоли маркетолога, создаваемая в момент запуска рассылки. Каждая рассылка может быть выполнена произвольное количество раз и с различными настройками; для каждого случая будет создан отдельный запуск (launch). Канал – контейнер для обработки обращений клиентов и рассылок по определенной теме или иным характеристикам. Клиент – заказчик, покупатель или приобретатель услуг, обратившийся в компанию при помощи одного из мессенджеров. Компания – организация, зарегистрированная в Maxbot и использующая бота для коммуникации с клиентами. Мессенджер – одна из возможных платформ коммуникации с клиентом: • Viber; • Telegram; • ВКонтакте; • Facebook*; • Instagram*. Консоль управления (Studio) – интерфейс Maxbot, предназначенный для настройки перечня ботов и их навыков, каналов, операторов и маркетологов. Рассылка – совокупность сценария, аудитории и условий начала рассылки. Сценарий рассылки – набор действий, выполняемых при проведении рассылки для каждого клиента. Например, отправка ему сообщений и изображений через заданный промежуток времени. Условия начала рассылки – условия, при которых сценарий рассылки запускается для каждого из клиентов в аудитории рассылки. Например, наступление определенного времени, установка тега для клиента или возникновение внешнего события (клиент посетил сайт, оплатил заказ). jinja- выражение – регулярное выражение шаблонизатора для языка программирования Python.",
    "meta": {
      "page": 167,
      "section": "• ACCOUNT_UPDATE"
    }
  },
  {
    "text": "провайдер – организация, обеспечивающая отправку коротких сообщений (SMS). Она предоставляет доступ к SMS-шлюзу, при помощи",
    "meta": {
      "page": 167,
      "section": "SMS-"
    }
  },
  {
    "text": "169 Приложение А. Перечень значений часовых поясов В подразделах и связанных с ними таблицах приведены возможные значения часовых поясов. Актуальный перечень часовых поясов содержится в таблице pg_timezone_names базы данных Maxbot. Europe Europe/Amsterdam Europe/Andorra Europe/Astrakhan Europe/Athens Europe/Belfast Europe/Belgrade Europe/Berlin Europe/Bratislava Europe/Brussels Europe/Bucharest Europe/Budapest Europe/Busingen Europe/Chisinau Europe/Copenhagen Europe/Dublin Europe/Gibraltar Europe/Guernsey Europe/Helsinki Europe/Isle_of_Man Europe/Istanbul Europe/Jersey Europe/Kaliningrad Europe/Kiev Europe/Kirov Europe/Lisbon Europe/Ljubljana Europe/London Europe/Luxembourg Europe/Madrid Europe/Malta Europe/Mariehamn Europe/Minsk Europe/Monaco Europe/Moscow Europe/Nicosia Europe/Oslo Europe/Paris Europe/Podgorica Europe/Prague Europe/Riga Europe/Rome Europe/Samara Europe/San_Marino Europe/Sarajevo Europe/Saratov Europe/Simferopol Europe/Skopje Europe/Sofia Europe/Stockholm Europe/Tallinn Europe/Tirane Europe/Tiraspol Europe/Ulyanovsk Europe/Uzhgorod Europe/Vaduz Europe/Vatican Europe/Vienna Europe/Vilnius Europe/Volgograd Europe/Warsaw Europe/Zagreb Europe/Zaporozhye Europe/Zurich Asia Asia/Aden Asia/Almaty Asia/Amman Asia/Anadyr Asia/Aqtau Asia/Aqtobe Asia/Ashgabat Asia/Ashkhabad Asia/Atyrau Asia/Baghdad Asia/Bahrain Asia/Baku Asia/Bangkok Asia/Barnaul Asia/Beirut Asia/Bishkek Asia/Brunei Asia/Calcutta Asia/Chita Asia/Choibalsan Asia/Chongqing Asia/Chungking Asia/Colombo Asia/Dacca Asia/Damascus Asia/Dhaka Asia/Dili Asia/Dubai Asia/Dushanbe Asia/Famagusta Asia/Gaza Asia/Harbin Asia/Hebron Asia/Ho_Chi_Minh Asia/Hong_Kong Asia/Hovd Asia/Irkutsk Asia/Istanbul Asia/Jakarta Asia/Jayapura Asia/Jerusalem Asia/Kabul Asia/Kamchatka Asia/Karachi",
    "meta": {
      "page": 169,
      "section": "SMS-"
    }
  },
  {
    "text": "170 Asia/Kashgar Asia/Kathmandu Asia/Katmandu Asia/Khandyga Asia/Kolkata Asia/Krasnoyarsk Asia/Kuala_Lumpur Asia/Kuching Asia/Kuwait Asia/Macao Asia/Macau Asia/Magadan Asia/Makassar Asia/Manila Asia/Muscat Asia/Nicosia Asia/Novokuznetsk Asia/Novosibirsk Asia/Omsk Asia/Oral Asia/Phnom_Penh Asia/Pontianak Asia/Pyongyang Asia/Qatar Asia/Qostanay Asia/Qyzylorda Asia/Rangoon Asia/Riyadh Asia/Saigon Asia/Sakhalin Asia/Samarkand Asia/Seoul Asia/Shanghai Asia/Singapore Asia/Srednekolymsk Asia/Taipei Asia/Tashkent Asia/Tbilisi Asia/Tehran Asia/Tel_Aviv Asia/Thimbu Asia/Thimphu Asia/Tokyo Asia/Tomsk Asia/Ujung_Pandang Asia/Ulaanbaatar Asia/Ulan_Bator Asia/Urumqi Asia/Ust-Nera Asia/Vientiane Asia/Vladivostok Asia/Yakutsk Asia/Yangon Asia/Yekaterinburg Asia/Yerevan Africa Africa/Abidjan Africa/Accra Africa/Addis_Ababa Africa/Algiers Africa/Asmara Africa/Asmera Africa/Bamako Africa/Bangui Africa/Banjul Africa/Bissau Africa/Blantyre Africa/Brazzaville Africa/Bujumbura Africa/Cairo Africa/Casablanca Africa/Ceuta Africa/Conakry Africa/Dakar Africa/Dar_es_Salaam Africa/Djibouti Africa/Douala Africa/El_Aaiun Africa/Freetown Africa/Gaborone Africa/Harare Africa/Johannesburg Africa/Juba Africa/Kampala Africa/Khartoum Africa/Kigali Africa/Kinshasa Africa/Lagos Africa/Libreville Africa/Lome Africa/Luanda Africa/Lubumbashi Africa/Lusaka Africa/Malabo Africa/Maputo Africa/Maseru Africa/Mbabane Africa/Mogadishu Africa/Monrovia Africa/Nairobi Africa/Ndjamena Africa/Niamey Africa/Nouakchott Africa/Ouagadougou Africa/Porto-Novo Africa/Sao_Tome Africa/Timbuktu Africa/Tripoli Africa/Tunis Africa/Windhoek America America/Adak America/Anchorage America/Anguilla America/Antigua America/Araguaina America/Argentina/ Buenos_Aires America/Argentina/ Catamarca America/Argentina/ ComodRivadavia",
    "meta": {
      "page": 170,
      "section": "SMS-"
    }
  },
  {
    "text": "171 America/Argentina/ Cordoba America/Argentina/ Jujuy America/Argentina/ La_Rioja America/Argentina/ Mendoza America/Argentina/ Rio_Gallegos America/Argentina/ Salta America/Argentina/ San_Luis America/Argentina/ Tucuman America/Argentina/ San_Juan America/Argentina/ Ushuaia America/Aruba America/Asuncion America/Atikokan America/Atka America/Bahia America/Bahia_ Banderas America/Barbados America/Belem America/Belize America/Blanc- Sablon America/Boa_Vista America/Bogota America/Boise America/Buenos_ Aires America/Cambridge_ Bay America/Campo_ Grande America/Cancun America/Caracas America/Catamarca America/Cayenne America/Cayman America/Chicago America/Chihuahua America/Coral_ Harbour America/Cordoba America/Costa_Rica America/Creston America/Cuiaba America/Curacao America/ Danmarkshavn America/Dawson America/Dawson_ Creek America/Denver America/Detroit America/Dominica America/Edmonton America/Eirunepe America/El_Salvador America/Ensenada America/Fort_Nelson America/Fort_ Wayne America/Fortaleza America/Glace_Bay America/Godthab America/Goose_ Bay America/Grand_Turk America/Grenada America/Guadeloupe America/Guatemala America/Guayaquil America/Guyana America/Halifax America/Havana America/Hermosillo America/Indiana/ Indianapolis America/Indiana/Knox America/Indiana/ Marengo America/Indiana/ Petersburg America/Indiana/ Tell_City America/Indiana/ Vevay America/Indiana/ Vincennes America/Indiana/ Winamac America/Indianapolis America/Inuvik America/Iqaluit America/Jamaica America/Jujuy America/Juneau America/Kentucky/ Louisville America/Kentucky/M onticello America/Knox_IN America/Kralendijk America/La_Paz America/Lima America/Los_Angeles America/Louisville America/Lower_Princes America/Maceio America/Managua America/Manaus America/Marigot America/Martinique America/Matamoros America/Mazatlan America/Mendoza America/ Menominee America/Merida America/Metlakatla America/Mexico_City America/Miquelon America/Moncton America/Monterrey America/Montevideo America/Montreal America/Montserrat America/Nassau America/New_York America/Nipigon America/Nome America/Noronha America/North_Dakota/ Beulah America/North_ Dakota/Center",
    "meta": {
      "page": 171,
      "section": "SMS-"
    }
  },
  {
    "text": "172 America/North_ Dakota/New_Salem America/Ojinaga America/Panama America/Pangnirtung America/Paramaribo America/Phoenix America/Port-au-Prince America/Port_of_ Spain America/Porto_Acre America/Porto_Velho America/Puerto_Rico America/Punta_ Arenas America/Rainy_River America/Rankin_Inlet America/Recife America/Regina America/Resolute America/Rio_Branco America/Rosario America/Santa_ Isabel America/Santarem America/Santiago America/Santo_ Domingo America/Sao_Paulo America/Scoresbysund America/Shiprock America/Sitka America/St_ Barthelemy America/St_Johns America/St_Kitts America/St_Lucia America/St_Thomas America/St_Vincent America/Swift_Current America/Tegucigalpa America/Thule America/Thunder_Bay America/Tijuana America/Toronto America/Tortola America/Vancouver America/Virgin America/Whitehorse America/Winnipeg America/Yakutat America/Yellowknife Australia Australia/ACT Australia/Adelaide Australia/Brisbane Australia/Broken_Hill Australia/Canberra Australia/Currie Australia/Darwin Australia/Eucla Australia/Hobart Australia/LHI Australia/Lindeman Australia/Lord_Howe Australia/Melbourne Australia/NSW Australia/North Australia/Perth Australia/Queensland Australia/South Australia/Sydney Australia/Tasmania Australia/Victoria Australia/West Australia/Yancowinna Indian Indian/Antananarivo Indian/Chagos Indian/Christmas Indian/Cocos Indian/Comoro Indian/Kerguelen Indian/Mahe Indian/Maldives Indian/Mauritius Indian/Mayotte Indian/Reunion Mexico Mexico/BajaNorte Mexico/BajaSur Mexico/General Other Antarctica/Casey Antarctica/Davis Antarctica/ DumontDUrville Antarctica/ Macquarie",
    "meta": {
      "page": 172,
      "section": "SMS-"
    }
  },
  {
    "text": "173 Antarctica/Mawson Antarctica/McMurdo Antarctica/Palmer Antarctica/Rothera Antarctica/South_Pole Antarctica/Syowa Antarctica/Troll Antarctica/Vostok Arctic/Longyearbyen Atlantic/Azores Atlantic/Bermuda Atlantic/Canary Atlantic/Cape_Verde Atlantic/Faeroe Atlantic/Faroe Atlantic/Jan_Mayen Atlantic/Madeira Atlantic/Reykjavik Atlantic/South_ Georgia Atlantic/St_Helena Atlantic/Stanley Brazil/Acre Brazil/DeNoronha Brazil/East Brazil/West Canada/Atlantic Canada/Centra Canada/Eastern Canada/Mountain Canada/Newfoundland Canada/Pacific Canada/Saskatchewan Canada/Yukon Chile/Continental Chile/EasterIsland",
    "meta": {
      "page": 173,
      "section": "SMS-"
    }
  },
  {
    "text": "174 Приложение Б. Типы макросов Макросы могут иметь следующие типы: • “date” — дата и время (используется формат ISO 8601); • “decimal“ — число, в т. ч. вещественное; • “categorical“ — фиксированное число возможных значений; • “boolean“ — логическое значение; • “string“ — строка. Для отправки клиентам в макросах рассылки персонализированных многострочных текстов можно использовать символ разделения строк — \\n (в макросах типа «string»). Эта возможность доступна только для API-вызовов, при вызове события из интерфейса (тестовый вызов события из консоли маркетолога) клиент получит \\n в тексте рассылки.",
    "meta": {
      "page": 174,
      "section": "WET"
    }
  },
  {
    "text": "175 Приложение В. Настройка SMS-провайдера «СМС услуги» Сайт сервиса — https://sms-uslugi.ru/, личный кабинет — https://lcab.sms-uslugi.ru/. При работе с провайдером «СМС услуги» есть ряд особенностей: 1. При создании SMS-провайдера в поле «Логин» указывается произвольная последовательность символов, например, «12345» (см. Рисунок 216). Рисунок 216 — Ввод параметров для SMS-провайдера «СМС услуги» 2. В поле «Пароль» необходимо указать токен, который создается в личном кабинете сервиса (раздел «API» - «Рассылка сообщений», см. Рисунок 217):",
    "meta": {
      "page": 175,
      "section": "WET"
    }
  },
  {
    "text": "176 Рисунок 217 — Раздел «API» личного кабинета на сервисе «СМС услуги» Значение для пароля берется из столбца Token (см. Рисунок 218): Рисунок 218 — Подраздел «Рассылка сообщений», в котором генерируется токен 3. В поле «Отправитель» указывается отправитель, добавленный в разделе «Рассылка СМС» - «Имена отправителя» (см. Рисунок 219):",
    "meta": {
      "page": 176,
      "section": "WET"
    }
  },
  {
    "text": "177 Рисунок 219 — Настройка имени отправителя Примечание: Для целей тестирования можно использовать сообщения «test» и «тест».",
    "meta": {
      "page": 177,
      "section": "WET"
    }
  },
  {
    "text": "178 Приложение Г. Настройка SMS-провайдера «SMS.ru» Сайт сервиса — https://sms.ru/, личный кабинет — https://sms.ru/?panel=my. При работе с провайдером «SMS.ru» есть ряд особенностей: 1. При создании SMS-провайдера в поле «Отправитель» указывается зарегистрированный в SMS.ru отправитель или номер телефона, на который зарегистрирован аккаунт (если отправитель не зарегистрирован). 2. В поле «Пароль» указывается «api_id», который можно получить в разделе «Программистам» - «Ваш api_id» личного кабинета SMS.ru (см. Рисунок 220). Рисунок 220 — api-токен в личном кабинете SMS.ru Примечания * Meta (соцсети Facebook и Instagram) признана в России экстремистской организацией, ее деятельность на территории страны запрещена.",
    "meta": {
      "page": 178,
      "section": "WET"
    }
  }
]